granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
/*----------------------------------------------------------------------------------------------------------------------------------------
 * http.cpp - http server
 *
 * Copyright (c) 2016-2025 Frank Meyer - frank(at)uclock.de
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *----------------------------------------------------------------------------------------------------------------------------------------
 */
#include <ESP8266WiFi.h>
#include <ESP8266httpUpdate.h>
#include <Updater.h>
#include <WString.h>
#include <FS.h>
#include <LittleFS.h>
#include "base.h"
#include "vars.h"
#include "wifi.h"
#include "version.h"
#include "http.h"
#include "httpclient.h"
#include "stm32flash.h"
#include "tables.h"
#include "eepromdata.h"

#define WCLOCK24H   1

const char *                wdays_en[7] = { "Su", "Mo", "Tu", "We", "Th", "Fr", "Sa" };
const char *                wdays_de[7] = { "So", "Mo", "Di", "Mi", "Do", "Fr", "Sa" };

WiFiServer                  http_server(80);                                        // create an instance of the server on Port 80
static WiFiClient           http_client;

static const char *         pgm_name = "unknown Clock";
static const char *         hardware = "unknown";
static uint_fast16_t        hardware_configuration = 0xFFFF;

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * firmware update parameters
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define DEFAULT_UPDATE_HOST                         "uclock.de"
#define DEFAULT_UPDATE_PATH                         "update"

#define ESP_WORDCLOCK_TXT                           "ESP-WordClock.txt"             // avaliable version of ESP8266 firmware
#define APP_VERSION_TXT                             "app-version.txt"               // available version of app files
#define ESP_WORDCLOCK_BIN                           "ESP-WordClock-4M.bin"          // name of ES8266 firmware bin file

#define RELEASENOTE_HTML                            "releasenote.html"              // release notes
#define WC_TXT                                      "wc.txt"                        // avaliable version of STM32 firmware
#define WC_LIST_TXT                                 "wc-list.txt"                   // list of available STM32 firmware files
#define WC_TABLES_LIST_TXT                          "wc-list-tables.txt"            // list of available layout table files

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * http parameters
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define MAX_LINE_LEN                                256                             // max. length of line_buffer
#define MAX_PATH_LEN                                20                              // max. length of path
#define MAX_HTTP_PARAMS                             16                              // max. number of http parameters

typedef struct
{
    char *  name;
    char *  value;
} HTTP_PARAMETERS;

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * globals
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static HTTP_PARAMETERS                              http_parameters[MAX_HTTP_PARAMS];
static int                                          bgcolor_cnt;

#define MAX_KEY_LEN                                 64
#define MAX_IP_LEN                                  15
#define MAX_TIMEZONE_LEN                            3
#define MAX_DATE_LEN                                10
#define MAX_TIME_LEN                                5
#define MAX_BRIGHTNESS_LEN                          2
#define MAX_COLOR_VALUE_LEN                         2
#define MAX_TEMP_CORR_LEN                           3
#define MAX_MINUTE_INTERVAL_LEN                     2
#define MAX_TICKER_DECELERATION_LEN                 3
#define MAX_RAINBOW_DECELERATION_LEN                3
#define MAX_RAW_VALUE_LEN                           5
#define MAX_ANIMATION_DECELERATION_LEN              2
#define MAX_COLOR_ANIMATION_DECELERATION_LEN        2
#define MAX_AMBILIGHT_MODE_DECELERATION_LEN         2

#define MAIN_HEADER_COLS                            2
#define DATETIME_HEADER_COLS                        6
#define TICKER_HEADER_COLS                          2
#define NETWORK_HEADER_COLS                         4
#define NETWORK_HEADER_COLS2                        3
#define WEATHER_HEADER_COLS                         3
#define DISPLAY_HEADER_COLS                         3
#define OVERLAY_HEADER_COLS                         10
#define ANIMATION_HEADER_COLS                       3
#define ANIMATION_DECELERATION_HEADER_COLS          5
#define COLOR_ANIMATION_DECELERATION_HEADER_COLS    4
#define AMBILIGHT_MODE_DECELERATION_HEADER_COLS     4
#define TIMERS_HEADER_COLS                          8
#define ALARM_TIMERS_HEADER_COLS                    7
#define UPDATE_HEADER_COLS                          2

#define DFPLAYER_HEADER_COLS                        3
#define DFPLAYER_SILENCE_COLS                       4

#define MAX_HTTP_RESPONSE_LEN                       1024
static char     http_response[MAX_HTTP_RESPONSE_LEN + 1];
static int      http_response_len = 0;

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * display flags:
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define DISPLAY_FLAGS_NONE                          0x00                    // no display flag
#define DISPLAY_FLAGS_PERMANENT_IT_IS               0x01                    // show "ES IST" permanently
#define DISPLAY_FLAGS_SYNC_AMBILIGHT                0x02                    // synchronize display and ambilight
#define DISPLAY_FLAGS_SYNC_CLOCK_MARKERS            0x04                    // synchronize display and clock markers
#define DISPLAY_FLAGS_FADE_CLOCK_SECONDS            0x08                    // fade clock seconds

/*--------------------------------------------------------------------------------------------------------------------------------------
 * possible modes of ESP8266
 *--------------------------------------------------------------------------------------------------------------------------------------
 */
#define ESP8266_CLIENT_MODE                         0
#define ESP8266_AP_MODE                             1

#define ESP8266_MAX_FIRMWARE_SIZE                   16
#define ESP8266_MAX_ACCESSPOINT_SIZE                32
#define ESP8266_MAX_IPADDRESS_SIZE                  16
#define ESP8266_MAX_HTTP_GET_PARAM_SIZE             256
#define ESP8266_MAX_CMD_SIZE                        32
#define ESP8266_MAX_TIME_SIZE                       16

#define MAX_COLOR_STEPS                             64

/*--------------------------------------------------------------------------------------------------------------------------------------
 * max update filename len
 *--------------------------------------------------------------------------------------------------------------------------------------
 */
#define MAX_UPDATE_FILENAME_LEN                     64

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * pwa parameters
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define PWA_PREFIX                                  "/app"
#define PWA_INDEX_FILE                              "app-index.html"
static void             http_json_ok ();
static uint_fast8_t     http_get_on_off_value (const char * param, uint_fast8_t current_value);
static void             http_build_stm32_default_filename (char * stm32_default_filename, size_t max_len, const char ** filter);
static int              http_api_stm32_log ();
static int              http_api_stm32_log_clear ();
static int              http_api_remote_stm32_flash ();
static int              http_api_remote_esp_update ();
static int              http_api_device_ready ();
static int              http_api_reconnect_probe ();
static void             http_json_send_remote_update_support_fields ();
static void             http_json_send_remote_update_url_fields ();
static char *           http_get_param (const char * name);
static int              http_api_settings_xml ();
static int              http_api_display_power ();
static int              http_api_ambilight_power ();
static int              http_api_power_status ();
static int              http_api_update_progress ();
static uint_fast8_t     http_filename_matches (const char * actual, const char * expected);
static uint_fast8_t     http_local_stm32_filename_matches (const char * actual);
static uint_fast8_t     http_remote_stm32_filename_matches (const char * actual);
static uint_fast8_t     http_table_download_filename_matches (const char * actual);
static void             http_remove_table_family_files (const char * keep_filename);
static void             http_fetch_remote_line (const char * host, const char * path, const char * filename, char * buffer, size_t buffer_len);
static bool             app_asset_filename (const char * asset_path, char * filename, size_t maxlen);
static uint_fast8_t     http_app_asset_supports_gzip (const char * asset_path);
static bool             app_asset_storage_filename (const char * asset_path, uint_fast8_t gzip_encoded, char * filename, size_t maxlen);
static uint_fast8_t     http_find_stored_app_asset_filename (const char * asset_path, char * filename, size_t maxlen, uint_fast8_t * gzip_encoded);
static const char *     http_find_app_install_asset (const char * asset_path);
static uint_fast8_t     http_api_app_file_upload ();
static int8_t           http_decode_temp_correction (unsigned int value);
static unsigned int     http_encode_temp_correction (int temp_corr);
static int              http_clamp_temp_correction (int temp_corr);
static void             http_clear_request_user_agent (void);
static void             http_capture_request_user_agent (const String& line);
static const char *     http_get_request_browser_label (void);
static bool             http_read_request_line (String& line, unsigned long timeout_ms);

static const char * const APP_INSTALL_ASSETS[] =
{
    "app/index.html",
    "app/styles.css",
    "app/layout-previews.json",
    "app/icons/icon-192.svg",
    "app/icons/icon-512.svg",
    "app/manifest.webmanifest",
    "app/app.js",
    "app/sw.js"
};
static int              http_api_live_display_color ();
static const char *     http_get_configured_icon_filename (void);
static const char *     http_get_configured_weather_filename (void);
static const char *     http_find_existing_filename (const char * preferred, const char * const * candidates, size_t candidate_count);
static String           sanitize_json_string (const String& str);
static void             update_progress_stream_emit (const char * event_name);
static void             update_progress_stream_start (void);
static void             update_progress_stream_finish (void);

typedef struct
{
    uint_fast8_t    active;
    char            type[16];
    char            state[24];
    char            message[128];
    uint32_t        progress_current;
    uint32_t        progress_total;
    uint32_t        error_code;
    uint32_t        started_at;
    uint32_t        updated_at;
    uint32_t        finished_at;
} UPDATE_PROGRESS;

static UPDATE_PROGRESS   update_progress;
static uint_fast8_t     update_progress_stream_active;
static char             http_request_user_agent[96];
static unsigned char    http_download_buf[1024];
static char             http_app_asset_local_filename[128];
static char             http_app_asset_remote_filename[128];
static char             http_app_asset_stale_filename[128];

static void
http_clear_request_user_agent (void)
{
    http_request_user_agent[0] = '\0';
}

static void
http_capture_request_user_agent (const String& line)
{
    String ua;

    if (! line.startsWith ("User-Agent:"))
    {
        return;
    }

    ua = line.substring (11);
    ua.trim ();

    if (ua.length () == 0)
    {
        http_clear_request_user_agent ();
        return;
    }

    if (ua.indexOf ("FxiOS/") >= 0 || ua.indexOf ("Firefox/") >= 0)
    {
        strncpy (http_request_user_agent, "Firefox", sizeof (http_request_user_agent) - 1);
    }
    else if (ua.indexOf ("EdgiOS/") >= 0 || ua.indexOf ("EdgA/") >= 0 || ua.indexOf ("Edg/") >= 0)
    {
        strncpy (http_request_user_agent, "Edge", sizeof (http_request_user_agent) - 1);
    }
    else if (ua.indexOf ("OPiOS/") >= 0 || ua.indexOf ("OPR/") >= 0)
    {
        strncpy (http_request_user_agent, "Opera", sizeof (http_request_user_agent) - 1);
    }
    else if (ua.indexOf ("CriOS/") >= 0 || ua.indexOf ("Chrome/") >= 0)
    {
        strncpy (http_request_user_agent, "Chrome", sizeof (http_request_user_agent) - 1);
    }
    else if (ua.indexOf ("Safari/") >= 0)
    {
        strncpy (http_request_user_agent, "Safari", sizeof (http_request_user_agent) - 1);
    }
    else
    {
        strncpy (http_request_user_agent, ua.c_str (), sizeof (http_request_user_agent) - 1);
    }

