granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    http_request_user_agent[sizeof (http_request_user_agent) - 1] = '\0';
}

static const char *
http_get_request_browser_label (void)
{
    return http_request_user_agent[0] ? http_request_user_agent : (const char *) 0;
}

static void
update_progress_copy (char * dst, size_t dst_size, const char * src)
{
    if (! dst || ! dst_size)
    {
        return;
    }

    strncpy (dst, src ? src : "", dst_size - 1);
    dst[dst_size - 1] = '\0';
}

static void
update_progress_stream_emit (const char * event_name)
{
    char buf[16];

    if (! update_progress_stream_active)
    {
        return;
    }

    http_send (FS("{\"ok\":true,\"event\":\""));
    http_send (sanitize_json_string (event_name ? event_name : "progress").c_str ());
    http_send (FS("\",\"active\":"));
    http_send (update_progress.active ? "true" : "false");
    http_send (FS(",\"type\":\""));
    http_send (sanitize_json_string (update_progress.type).c_str ());
    http_send (FS("\",\"state\":\""));
    http_send (sanitize_json_string (update_progress.state).c_str ());
    http_send (FS("\",\"message\":\""));
    http_send (sanitize_json_string (update_progress.message).c_str ());
    http_send (FS("\",\"progress_current\":"));
    sprintf (buf, "%u", (unsigned) update_progress.progress_current);
    http_send (buf);
    http_send (FS(",\"progress_total\":"));
    sprintf (buf, "%u", (unsigned) update_progress.progress_total);
    http_send (buf);
    http_send (FS(",\"error_code\":"));
    sprintf (buf, "%u", (unsigned) update_progress.error_code);
    http_send (buf);
    http_send (FS(",\"started_at\":"));
    sprintf (buf, "%u", (unsigned) update_progress.started_at);
    http_send (buf);
    http_send (FS(",\"updated_at\":"));
    sprintf (buf, "%u", (unsigned) update_progress.updated_at);
    http_send (buf);
    http_send (FS(",\"finished_at\":"));
    sprintf (buf, "%u", (unsigned) update_progress.finished_at);
    http_send (buf);
    http_send (FS("}\n"));
    http_flush ();
}

static void
update_progress_stream_start (void)
{
    update_progress_stream_active = 1;
}

static void
update_progress_stream_finish (void)
{
    update_progress_stream_active = 0;
}

static uint_fast8_t
http_filename_matches (const char * actual, const char * expected)
{
    return actual && expected && ! strcmp (actual, expected) ? 1 : 0;
}

static uint_fast8_t
http_tables_filename_matches (const char * actual, const char * target_filename)
{
    size_t expected_prefix_len;

    if (! actual || ! target_filename)
    {
        return 0;
    }

    expected_prefix_len = strlen (target_filename);

    if (expected_prefix_len < strlen ("local.txt"))
    {
        return 0;
    }

    expected_prefix_len -= strlen ("local.txt");

    if (strncmp (actual, target_filename, expected_prefix_len))
    {
        return 0;
    }

    return strstr (actual, ".txt") && ! strcmp (actual + strlen (actual) - 4, ".txt") ? 1 : 0;
}

static const char *
http_get_configured_icon_filename (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-icon.txt";
        case HW_WC_12H: return "wc12h-icon.txt";
        case HW_UCLOCK: return "uc-icon.txt";
    }

    return (const char *) 0;
}

static const char *
http_get_configured_weather_filename (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-weather.txt";
        case HW_WC_12H: return "wc12h-weather.txt";
        case HW_UCLOCK: return "uc-weather.txt";
    }

    return (const char *) 0;
}

static const char *
http_get_tables_family_prefix (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-tables-";
        case HW_WC_12H: return "wc12h-tables-";
    }

    return (const char *) 0;
}

static const char *
http_get_default_layout_preview_filename (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-tables-de.txt";
        case HW_WC_12H: return "wc12h-tables-de.txt";
    }

    return (const char *) 0;
}

static uint_fast8_t
http_get_default_layout_columns (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return 11;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return 18;
        case HW_WC_12H: return 11;
        default: return 11;
    }
}

static bool
http_read_request_line (String& line, unsigned long timeout_ms)
{
    int             c = -1;
    unsigned long   start_millis = millis ();

    line = "";

    do
    {
        if (http_client.available ())
        {
            start_millis = millis ();
            c = http_client.read ();

            if (c >= 0 && c != '\n' && c != '\r')
            {
                line += (char) c;
            }
        }
        else if ((millis () - start_millis) >= timeout_ms)
        {
            return false;
        }
    } while (c >= 0 && c != '\r');

    return true;
}

static const char *
http_get_asset_prefix (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h";
        case HW_WC_12H: return "wc12h";
        case HW_UCLOCK: return "uc";
    }

    return (const char *) 0;
}

static const char *
http_get_hardware_label (void)
{
    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "WC24h";
        case HW_WC_12H: return "WC12h";
        case HW_UCLOCK: return "uClock";
    }

    return "unbekannt";
}

static const char *
http_get_processor_label (void)
{
    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8: return "STM32F103C8";
        case HW_STM32_F401RE: return "STM32F401RE";
        case HW_STM32_F411RE: return "STM32F411RE";
        case HW_STM32_F446RE: return "STM32F446RE";
        case HW_STM32_F407VE: return "STM32F407VE";
        case HW_STM32_F401CC: return "STM32F401CC";
        case HW_STM32_F411CE: return "STM32F411CE";
    }

    return "unbekannt";
}

static const char *
http_get_board_label (void)
{
    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8: return "BluePill";
        case HW_STM32_F401RE:
        case HW_STM32_F411RE:
        case HW_STM32_F446RE: return "Nucleo";
        case HW_STM32_F407VE: return "BlackBoard";
        case HW_STM32_F401CC:
        case HW_STM32_F411CE: return "BlackPill";
    }

    return "unbekannt";
}

static const char *
http_get_frequency_label (void)
{
    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8: return "72 MHz";
        case HW_STM32_F401RE: return "84 MHz";
        case HW_STM32_F411RE: return "100 MHz";
        case HW_STM32_F446RE: return "180 MHz";
        case HW_STM32_F407VE: return "168 MHz";
        case HW_STM32_F401CC: return "84 MHz";
        case HW_STM32_F411CE: return "100 MHz";
    }

    return "unbekannt";
}

static const char *
http_get_oscillator_label (void)
{
    switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
    {
        case HW_OSC_FREQUENCY_8MHZ: return "8 MHz";
        case HW_OSC_FREQUENCY_25MHZ: return "25 MHz";
    }

    return "unbekannt";
}

static const char *
http_get_display_label (void)
{
    switch (hardware_configuration & HW_LED_MASK)
    {
        case HW_LED_WS2812_GRB_LED: return "WS2812 GRB";
        case HW_LED_WS2812_RGB_LED: return "WS2812 RGB";
        case HW_LED_APA102_RGB_LED: return "APA102 RGB";
        case HW_LED_SK6812_RGB_LED: return "SK6812 RGB";
        case HW_LED_SK6812_RGBW_LED: return "SK6812 RGBW";
        case HW_LED_TFTLED_RGB_LED: return "TFT RGB";
    }

    return "unbekannt";
}

static const char *
http_get_display_led_mode (void)
{
    switch (hardware_configuration & HW_LED_MASK)
    {
        case HW_LED_SK6812_RGBW_LED: return "rgbw";
        case HW_LED_WS2812_GRB_LED:
        case HW_LED_WS2812_RGB_LED:
        case HW_LED_APA102_RGB_LED:
        case HW_LED_SK6812_RGB_LED: return "rgb";
        case HW_LED_TFTLED_RGB_LED: return "tft";
    }

    return "none";
}

static void
http_json_send_field_prefix (const char * key)
{
    http_send (FS(",\""));
    http_send (key);
    http_send (FS("\":"));
}

static void
http_json_send_bool_field (const char * key, uint_fast8_t value)
{
    http_json_send_field_prefix (key);
    http_send (value ? "true" : "false");
}

static void
http_json_send_uint_field (const char * key, unsigned long value)
{
    http_json_send_field_prefix (key);
    http_send (String (value).c_str ());
}

static void
http_json_send_string_field (const char * key, const char * value)
{
    http_json_send_field_prefix (key);
    http_send (FS("\""));
    http_send (sanitize_json_string (value ? value : "").c_str ());
    http_send (FS("\""));
}

static void
http_json_send_string_field (const char * key, const String& value)
{
    http_json_send_string_field (key, value.c_str ());
}

static const char *
http_get_local_update_message (uint32_t flashsize)
{
    if (flashsize < 1048576UL)
    {
        return "Lokales Update ist bei dieser ESP-Flashgroesse nicht verfuegbar.";
    }

    return "ESP- oder STM32-Datei auswaehlen und direkt lokal hochladen.";
}

static const char *
http_find_existing_filename (const char * preferred, const char * const * candidates, size_t candidate_count)
{
    size_t idx;

    if (preferred && LittleFS.exists (preferred))
    {
        return preferred;
    }

    for (idx = 0; idx < candidate_count; idx++)
    {
        const char * candidate = candidates[idx];

        if (candidate && (! preferred || strcmp (candidate, preferred)) && LittleFS.exists (candidate))
        {
            return candidate;
        }
    }

    return preferred;
}

static uint_fast8_t
http_local_stm32_filename_matches (const char * actual)
{
    char            default_filename[MAX_UPDATE_FILENAME_LEN];
    const char *    filter = (const char *) NULL;

    if (! actual)
    {
        return 0;
    }

    http_build_stm32_default_filename (default_filename, sizeof (default_filename), &filter);

