granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (! default_filename[0])
    {
        return 0;
    }

    return http_filename_matches (actual, default_filename);
}

static uint_fast8_t
http_remote_stm32_filename_matches (const char * actual)
{
    char            default_filename[MAX_UPDATE_FILENAME_LEN];
    const char *    filter = (const char *) NULL;

    if (! actual || ! *actual)
    {
        return 0;
    }

    http_build_stm32_default_filename (default_filename, sizeof (default_filename), &filter);

    if (! filter || strlen (actual) < 6)
    {
        return 0;
    }

    return ! strncmp (actual + 6, filter, strlen (filter)) ? 1 : 0;
}

static uint_fast8_t
http_local_esp_filename_matches (const char * actual)
{
    size_t len;

    if (! actual)
    {
        return 0;
    }

    len = strlen (actual);

    return len >= 4 && ! strcmp (actual + len - 4, ".bin") ? 1 : 0;
}

static uint_fast8_t
http_table_download_filename_matches (const char * actual)
{
    const char * prefix = (const char *) NULL;

    if (! actual)
    {
        return 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: prefix = "wc24h-tables-"; break;
        case HW_WC_12H: prefix = "wc12h-tables-"; break;
        default:        prefix = (const char *) NULL; break;
    }

    if (! prefix)
    {
        return 0;
    }

    return ! strncmp (actual, prefix, strlen (prefix)) && strstr (actual, ".txt") && ! strcmp (actual + strlen (actual) - 4, ".txt") ? 1 : 0;
}

static void
http_remove_table_family_files (const char * keep_filename)
{
    Dir             dir;
    const char *    prefix = (const char *) NULL;

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: prefix = "wc24h-tables-"; break;
        case HW_WC_12H: prefix = "wc12h-tables-"; break;
        default:        prefix = (const char *) NULL; break;
    }

    if (! prefix)
    {
        return;
    }

    dir = LittleFS.openDir ("");

    while (dir.next ())
    {
        String str = dir.fileName ();
        const char * current = str.c_str ();
        int len = strlen (current);

        if (! strncmp (current, prefix, strlen (prefix)) &&
            len > 4 &&
            ! strcmp (current + len - 4, ".txt") &&
            (! keep_filename || strcmp (current, keep_filename)))
        {
            LittleFS.remove (current);
        }
    }
}

void
update_progress_begin (const char * type, const char * state, const char * message)
{
    memset (&update_progress, 0, sizeof (update_progress));
    update_progress.active = 1;
    update_progress.started_at = millis ();
    update_progress.updated_at = update_progress.started_at;
    update_progress_copy (update_progress.type, sizeof (update_progress.type), type);
    update_progress_copy (update_progress.state, sizeof (update_progress.state), state ? state : "starting");
    update_progress_copy (update_progress.message, sizeof (update_progress.message), message);
    update_progress_stream_emit ("begin");
}

void
update_progress_state (const char * state, const char * message)
{
    update_progress.updated_at = millis ();

    if (state)
    {
        update_progress_copy (update_progress.state, sizeof (update_progress.state), state);
    }

    if (message)
    {
        update_progress_copy (update_progress.message, sizeof (update_progress.message), message);
    }

    update_progress_stream_emit ("state");
}

void
update_progress_set_progress (uint32_t current, uint32_t total)
{
    update_progress.progress_current = current;
    update_progress.progress_total = total;
    update_progress.updated_at = millis ();
    update_progress_stream_emit ("progress");
}

void
update_progress_complete (const char * message)
{
    update_progress.active = 0;
    update_progress.updated_at = millis ();
    update_progress.finished_at = update_progress.updated_at;
    update_progress_copy (update_progress.state, sizeof (update_progress.state), "done");

    if (message)
    {
        update_progress_copy (update_progress.message, sizeof (update_progress.message), message);
    }

    update_progress_stream_emit ("complete");
}

void
update_progress_fail (uint32_t error_code, const char * message)
{
    update_progress.active = 0;
    update_progress.error_code = error_code;
    update_progress.updated_at = millis ();
    update_progress.finished_at = update_progress.updated_at;
    update_progress_copy (update_progress.state, sizeof (update_progress.state), "error");

    if (message)
    {
        update_progress_copy (update_progress.message, sizeof (update_progress.message), message);
    }

    update_progress_stream_emit ("error");
}

void
update_progress_clear (void)
{
    memset (&update_progress, 0, sizeof (update_progress));
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * flush output buffer
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_flush (void)
{
    if (http_response_len > 0)
    {
        http_client.print (http_response);
        http_client.flush ();
        http_response[0] = '\0';
        http_response_len = 0;
    }
}

static void
http_concat_response (const char * s, int len)
{
    strncpy (http_response + http_response_len, s, len);
    http_response_len += len;
    http_response[http_response_len] = '\0';
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * send string
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_send (const char * s)
{
    int len = strlen (s);

    while (http_response_len + len > MAX_HTTP_RESPONSE_LEN)
    {
        int rest = MAX_HTTP_RESPONSE_LEN - http_response_len;

        http_concat_response (s, rest);
        http_flush ();

        len -= rest;
        s += rest;
    }

    http_concat_response (s, len);
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * send string
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_send (String s)
{
    http_send (s.c_str());
}

static void
http_send_json_escaped (const char * s)
{
    while (s && *s)
    {
        char ch = *s++;

        switch (ch)
        {
            case '\\':
                http_send (FS("\\\\"));
                break;
            case '"':
                http_send (FS("\\\""));
                break;
            case '\r':
                http_send (FS("\\r"));
                break;
            case '\n':
                http_send (FS("\\n"));
                break;
            case '\t':
                http_send (FS("\\t"));
                break;
            default:
            {
                char buffer[2];

                buffer[0] = ch;
                buffer[1] = '\0';
                http_send (buffer);
                break;
            }
        }
    }
}

static const char *
http_content_type (const char * path)
{
    const char * p = strrchr (path, '.');

