granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (! p)
    {
        return "text/plain";
    }

    if (! strcmp (p, ".html"))
    {
        return "text/html; charset=utf-8";
    }
    else if (! strcmp (p, ".css"))
    {
        return "text/css; charset=utf-8";
    }
    else if (! strcmp (p, ".js"))
    {
        return "application/javascript; charset=utf-8";
    }
    else if (! strcmp (p, ".webmanifest"))
    {
        return "application/manifest+json; charset=utf-8";
    }
    else if (! strcmp (p, ".json"))
    {
        return "application/json; charset=utf-8";
    }
    else if (! strcmp (p, ".svg"))
    {
        return "image/svg+xml";
    }
    else if (! strcmp (p, ".png"))
    {
        return "image/png";
    }
    else if (! strcmp (p, ".ico"))
    {
        return "image/x-icon";
    }

    return "text/plain";
}

static uint_fast8_t
http_send_fs_file (const char * filename, const char * content_type, uint_fast8_t gzip_encoded)
{
    uint_fast8_t    rtc = 0;

    LittleFS.begin ();

    if (LittleFS.exists (filename))
    {
        File fp = LittleFS.open (filename, "r");

        if (fp)
        {
            http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: "));
            http_send (content_type);

            if (gzip_encoded)
            {
                http_send (FS("\r\nContent-Encoding: gzip"));
            }

            http_send (FS("\r\nContent-Length: "));
            http_send (String (fp.size ()).c_str ());
            http_send (FS("\r\nCache-Control: no-cache\r\nConnection: close\r\n\r\n"));
            http_flush ();

            while (fp.available ())
            {
                uint8_t buf[256];
                size_t  len = fp.read (buf, sizeof (buf));

                if (len > 0)
                {
                    http_client.write (buf, len);
                }
            }

            http_client.flush ();
            fp.close ();
            http_client.stop ();
            rtc = 1;
        }
    }

    LittleFS.end ();

    return rtc;
}

static bool
http_fs_file_exists_and_nonempty (const char * filename)
{
    File fp;
    bool rtc = false;

    if (LittleFS.exists (filename))
    {
        fp = LittleFS.open (filename, "r");

        if (fp)
        {
            rtc = (fp.size () > 0);
            fp.close ();
        }
    }

    return rtc;
}

static bool
http_app_installation_complete (void)
{
    size_t  asset_count = sizeof (APP_INSTALL_ASSETS) / sizeof (APP_INSTALL_ASSETS[0]);
    bool    rtc = true;

    LittleFS.begin ();

    for (size_t idx = 0; idx < asset_count; idx++)
    {
        const char * asset_path = APP_INSTALL_ASSETS[idx];
        char flat_gz[72];
        char native_gz[72];

        const char * slash = strrchr (asset_path, '/');
        const char * base  = slash ? slash + 1 : asset_path;

        app_asset_storage_filename (asset_path, 1, flat_gz, sizeof (flat_gz));
        snprintf (native_gz, sizeof (native_gz), "%s.gz", base);

        if (! http_fs_file_exists_and_nonempty (flat_gz) &&
            ! http_fs_file_exists_and_nonempty (native_gz))
        {
            rtc = false;
            break;
        }
    }

    LittleFS.end ();
    return rtc;
}

static bool         download_file (const char * host, const char * path, const char * filename);
static bool         download_file_to_local (const char * host, const char * path, const char * remote_filename, const char * local_filename);
static bool         http_remote_app_files_available (char * version_buf, size_t version_buf_len);
static bool         download_file_as_flattened_app_asset (const char * host, const char * path, const char * remote_filename);

static bool
download_file_as_flattened_app_asset (const char * host, const char * path, const char * remote_filename)
{
    const char *    requested_remote_filename = remote_filename;
    uint_fast8_t    gzip_encoded = 0;

    if (http_app_asset_supports_gzip (remote_filename))
    {
        snprintf (http_app_asset_remote_filename, sizeof (http_app_asset_remote_filename), "%s.gz", remote_filename);
        requested_remote_filename = http_app_asset_remote_filename;
        gzip_encoded = 1;
    }

    if (! app_asset_storage_filename (remote_filename, gzip_encoded, http_app_asset_local_filename, sizeof (http_app_asset_local_filename)))
    {
        return false;
    }

    if (! download_file_to_local (host, path, requested_remote_filename, http_app_asset_local_filename))
    {
        return false;
    }

    if (app_asset_storage_filename (remote_filename, gzip_encoded ? 0 : 1, http_app_asset_stale_filename, sizeof (http_app_asset_stale_filename)))
    {
        LittleFS.remove (http_app_asset_stale_filename);
    }

    return true;
}

static int
http_try_auto_install_app_files (void)
{
    STR_VAR *   sv;
    char *      update_host;
    char *      update_path;
    size_t      idx;
    size_t      asset_count = sizeof (APP_INSTALL_ASSETS) / sizeof (APP_INSTALL_ASSETS[0]);
    int         rtc = 1;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    LittleFS.begin ();
    Serial.print (FS("(APPDL app-install-begin count="));
    Serial.print (asset_count);
    Serial.println (FS(")"));

    for (idx = 0; idx < asset_count; idx++)
    {
        uint_fast8_t is_gz = http_app_asset_supports_gzip (APP_INSTALL_ASSETS[idx]);

        if (! app_asset_storage_filename (APP_INSTALL_ASSETS[idx], is_gz, http_app_asset_local_filename, sizeof (http_app_asset_local_filename)))
        {
            Serial.print (FS("(APPDL app-install-fail step="));
            Serial.print (idx + 1);
            Serial.print (FS("/"));
            Serial.print (asset_count);
            Serial.print (FS(" remote="));
            Serial.print (APP_INSTALL_ASSETS[idx]);
            Serial.println (FS(" reason=filename)"));
            rtc = 0;
            break;
        }

        Serial.print (FS("(APPDL app-install-step "));
        Serial.print (idx + 1);
        Serial.print (FS("/"));
        Serial.print (asset_count);
        Serial.print (FS(" remote="));
        Serial.print (APP_INSTALL_ASSETS[idx]);
        if (is_gz) { Serial.print (FS(".gz")); }
        Serial.print (FS(" local="));
        Serial.print (http_app_asset_local_filename);
        Serial.println (FS(")"));

        if (! download_file_as_flattened_app_asset (update_host, update_path, APP_INSTALL_ASSETS[idx]))
        {
            Serial.print (FS("(APPDL app-install-fail step="));
            Serial.print (idx + 1);
            Serial.print (FS("/"));
            Serial.print (asset_count);
            Serial.print (FS(" remote="));
            Serial.print (APP_INSTALL_ASSETS[idx]);
            Serial.print (FS(" local="));
            Serial.print (http_app_asset_local_filename);
            Serial.println (FS(" reason=download)"));
            rtc = 0;
            break;
        }
    }

