granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    LittleFS.end ();

    if (rtc)
    {
        Serial.print (FS("(APPDL app-install-complete count="));
        Serial.print (asset_count);
        Serial.println (FS(")"));
    }

    return rtc;
}

static bool
http_remote_app_files_available (char * version_buf, size_t version_buf_len)
{
    STR_VAR *   sv;
    char *      update_host;
    char *      update_path;
    char        remote_filename[128];
    bool        app_files_available = false;

    if (version_buf && version_buf_len)
    {
        version_buf[0] = '\0';
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    if (version_buf && version_buf_len)
    {
        http_fetch_remote_line (update_host, update_path, APP_VERSION_TXT, version_buf, version_buf_len);
    }

    if (http_app_asset_supports_gzip (APP_INSTALL_ASSETS[0]))
    {
        snprintf (remote_filename, sizeof (remote_filename), "%s.gz", APP_INSTALL_ASSETS[0]);

        if (httpclient (update_host, update_path, remote_filename) > 0)
        {
            app_files_available = true;
            httpclient_stop ();
        }
    }
    else if (httpclient (update_host, update_path, APP_INSTALL_ASSETS[0]) > 0)
    {
        app_files_available = true;
        httpclient_stop ();
    }

    return app_files_available;
}

static bool
app_asset_filename (const char * asset_path, char * filename, size_t maxlen)
{
    size_t idx = 0;

    if (! asset_path || ! *asset_path)
    {
        return false;
    }

    for (const char * p = asset_path; *p && idx < maxlen - 1; p++)
    {
        if (*p == '/')
        {
            filename[idx++] = '-';
        }
        else
        {
            filename[idx++] = *p;
        }
    }

    filename[idx] = '\0';
    return idx > 0;
}

static const char *
http_find_app_install_asset (const char * asset_path)
{
    size_t asset_count = sizeof (APP_INSTALL_ASSETS) / sizeof (APP_INSTALL_ASSETS[0]);

    if (! asset_path || ! *asset_path)
    {
        return (const char *) 0;
    }

    for (size_t idx = 0; idx < asset_count; idx++)
    {
        if (! strcmp (asset_path, APP_INSTALL_ASSETS[idx]))
        {
            return APP_INSTALL_ASSETS[idx];
        }
    }

    return (const char *) 0;
}

static uint_fast8_t
http_app_asset_supports_gzip (const char * asset_path)
{
    const char * p = strrchr (asset_path ? asset_path : "", '.');

    if (! p)
    {
        return 0;
    }

    return (! strcmp (p, ".html") ||
            ! strcmp (p, ".css") ||
            ! strcmp (p, ".js") ||
            ! strcmp (p, ".json") ||
            ! strcmp (p, ".webmanifest") ||
            ! strcmp (p, ".svg"));
}

static bool
app_asset_storage_filename (const char * asset_path, uint_fast8_t gzip_encoded, char * filename, size_t maxlen)
{
    size_t len;

    if (! app_asset_filename (asset_path, filename, maxlen))
    {
        return false;
    }

    if (! gzip_encoded)
    {
        return true;
    }

    len = strlen (filename);

    if (len + 3 >= maxlen)
    {
        return false;
    }

    strcpy (filename + len, ".gz");
    return true;
}

static uint_fast8_t
http_find_stored_app_asset_filename (const char * asset_path, char * filename, size_t maxlen, uint_fast8_t * gzip_encoded)
{
    char local_filename[128];

    LittleFS.begin ();

    // flattened .gz  (OTA / PWA-upload path)
    if (app_asset_storage_filename (asset_path, 1, local_filename, sizeof (local_filename)) &&
        LittleFS.exists (local_filename))
    {
        if (filename && maxlen) { strncpy (filename, local_filename, maxlen - 1); filename[maxlen - 1] = '\0'; }
        if (gzip_encoded) { *gzip_encoded = 1; }
        return 1;
    }

    // basename .gz  (Arduino LittleFS upload tool — files stored flat in root)
    {
        const char * slash = strrchr (asset_path, '/');
        const char * base  = slash ? slash + 1 : asset_path;

        snprintf (local_filename, sizeof (local_filename), "%s.gz", base);

        if (LittleFS.exists (local_filename))
        {
            if (filename && maxlen) { strncpy (filename, local_filename, maxlen - 1); filename[maxlen - 1] = '\0'; }
            if (gzip_encoded) { *gzip_encoded = 1; }
            return 1;
        }
    }

    return 0;
}

static int8_t
http_decode_temp_correction (unsigned int value)
{
    return (int8_t) (value & 0xFF);
}

static unsigned int
http_encode_temp_correction (int temp_corr)
{
    return (uint8_t) ((int8_t) temp_corr);
}

static int
http_clamp_temp_correction (int temp_corr)
{
    if (temp_corr < -20)
    {
        temp_corr = -20;
    }
    else if (temp_corr > 20)
    {
        temp_corr = 20;
    }

    return temp_corr;
}

static uint_fast8_t
http_app (const char * path)
{
    char            filename[128];
    char            remote_app_version[16];
    const char *    content_type;
    const char *    action;
    uint_fast8_t    is_pwa_index = 0;
    uint_fast8_t    gzip_encoded = 0;
    uint_fast8_t    sent = 0;
    bool            app_complete;
    bool            remote_app_available = false;

    if (! strcmp (path, PWA_PREFIX) || ! strcmp (path, PWA_PREFIX "/"))
    {
        if (! http_find_stored_app_asset_filename ("app/index.html", filename, sizeof (filename), &gzip_encoded))
        {
            strncpy (filename, PWA_INDEX_FILE, sizeof (filename) - 1);
            filename[sizeof (filename) - 1] = '\0';
        }

        is_pwa_index = 1;
    }
    else if (! strncmp (path, PWA_PREFIX "/", strlen (PWA_PREFIX "/")))
    {
        char asset_path[128];

        snprintf (asset_path, sizeof (asset_path), "app/%s", path + strlen (PWA_PREFIX "/"));

        if (! http_find_stored_app_asset_filename (asset_path, filename, sizeof (filename), &gzip_encoded))
        {
            http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\n\r\nPWA asset not found\r\n"));
            http_flush ();
            return 0;
        }
    }
    else
    {
        return 0;
    }

    {
        char ct_buf[128];
        size_t ct_len;

        strncpy (ct_buf, filename, sizeof (ct_buf) - 1);
        ct_buf[sizeof (ct_buf) - 1] = '\0';
        ct_len = strlen (ct_buf);

