granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
        if (gzip_encoded && ct_len > 3)
        {
            ct_buf[ct_len - 3] = '\0';
        }

        content_type = http_content_type (ct_buf);
    }
    app_complete = http_app_installation_complete ();
    action = http_get_param ("action");

    if (is_pwa_index && action && ! strcmp (action, "install"))
    {
        remote_app_available = http_remote_app_files_available (remote_app_version, sizeof (remote_app_version));

        if (remote_app_available)
        {
            if (http_try_auto_install_app_files ())
            {
                http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: text/html; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));
                http_send (FS(
                    "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                    "<meta name='viewport' content='width=device-width, initial-scale=1'>"
                    "<meta http-equiv='refresh' content='3;url=/app/'>"
                    "<title>WordClock App wird installiert</title>"
                    "<style>"
                    "body{font-family:Arial,sans-serif;background:#0b1422;color:#eef4ff;padding:24px;line-height:1.5;}"
                    ".card{max-width:680px;margin:0 auto;background:#132033;border:1px solid rgba(255,255,255,.08);"
                    "border-radius:18px;padding:24px;box-shadow:0 20px 50px rgba(0,0,0,.25);}"
                    "h1{margin:0 0 12px;font-size:28px;}p{color:#c5d3ea;}a{display:inline-block;margin:8px 12px 0 0;"
                    "padding:12px 16px;border-radius:999px;text-decoration:none;background:#2d5275;color:#fff;"
                    "border:1px solid rgba(255,255,255,.15);}strong{color:#fff;}"
                    "</style></head><body><div class='card'>"
                    "<h1>WordClock App wird installiert</h1>"
                    "<p>Die WordClock PWA-Dateien wurden einzeln vom Update-Server geladen und im LittleFS gespeichert.</p>"
                    "<p><strong>Weiter so:</strong> Die Seite wechselt gleich automatisch nach <code>/app</code>.</p>"
                    "<a href='/app/'>Zur App</a>"
                    "<a href='/legacy'>Zur Legacy-Seite</a>"
                    "</div></body></html>"
                ));
                http_flush ();
                return 0;
            }

            http_send (FS("HTTP/1.0 500 Internal Server Error\r\nContent-Type: text/plain; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));
            http_send (FS("WordClock app file installation failed.\r\n"));
            http_flush ();
            return 0;
        }

        http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));
        http_send (FS("WordClock app files are not available on the configured update server.\r\n"));
        http_flush ();
        return 0;
    }

    if (is_pwa_index && ! app_complete)
    {
        remote_app_available = http_remote_app_files_available (remote_app_version, sizeof (remote_app_version));
    }

    if (! is_pwa_index || app_complete)
    {
        sent = http_send_fs_file (filename, content_type, gzip_encoded);
    }

    if (sent)
    {
        return 0;
    }

    if (! sent)
    {
        if (is_pwa_index)
        {
            http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: text/html; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));
            http_send (FS(
                "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                "<meta name='viewport' content='width=device-width, initial-scale=1'>"
                "<title>WordClock App noch nicht installiert</title>"
                "<style>"
                "body{font-family:Arial,sans-serif;background:#0b1422;color:#eef4ff;padding:24px;line-height:1.5;}"
                ".card{max-width:680px;margin:0 auto;background:#132033;border:1px solid rgba(255,255,255,.08);"
                "border-radius:18px;padding:24px;box-shadow:0 20px 50px rgba(0,0,0,.25);}"
                "h1{margin:0 0 12px;font-size:28px;}p{color:#c5d3ea;}a{display:inline-block;margin:8px 12px 0 0;"
                "padding:12px 16px;border-radius:999px;text-decoration:none;background:#2d5275;color:#fff;"
                "border:1px solid rgba(255,255,255,.15);}strong{color:#fff;}code{color:#fff;}"
                "</style></head><body><div class='card'>"
            ));

            if (remote_app_available)
            {
                http_send (FS("<h1>WordClock App ist lokal nicht installiert</h1>"));
                http_send (FS("<p>Auf diesem Gerät fehlen noch die App-Dateien im LittleFS, aber auf dem konfigurierten Update-Server ist eine WordClock PWA-Version verfügbar.</p>"));
                http_send (FS("<p><strong>Server-App verfügbar:</strong> "));
                if (remote_app_version[0])
                {
                    http_send (remote_app_version);
                }
                else
                {
                    http_send (FS("ja"));
                }
                http_send (FS("</p>"));
                http_send (FS("<p><strong>Weiter so:</strong> Die Erstinstallation wird direkt hier ueber die Zwischenmaske gestartet.</p>"));
                http_send (FS("<a href='/app/?action=install'>App jetzt installieren</a>"));
                http_send (FS("<a href='/fs'>Zu Dateien</a>"));
                http_send (FS("<a href='/update'>Zu Update</a>"));
                http_send (FS("<a href='/legacy'>Zur Legacy-Seite</a>"));
            }
            else
            {
                http_send (FS("<h1>WordClock App ist noch nicht installiert</h1>"));
                http_send (FS("<p>Auf diesem Gerät wurden noch keine vollständigen App-Dateien in das LittleFS geladen.</p>"));
                http_send (FS("<p><strong>Weiter so:</strong> Update-Host/-Pfad pruefen und die Erstinstallation danach wieder hier ueber <code>/app</code> anstossen.</p>"));
                http_send (FS("<a href='/fs'>Zu Dateien</a>"));
                http_send (FS("<a href='/update'>Zu Update</a>"));
                http_send (FS("<a href='/legacy'>Zur Legacy-Seite</a>"));
            }

            http_send (FS("</div></body></html>"));
        }
        else
        {
            http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\n\r\nPWA asset not found\r\n"));
        }
        http_flush ();
    }

