granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
        table_header (header_cols, TICKER_HEADER_COLS);
        table_row_input (thispage, 3, "Ticker", "ticker", "", MAX_TICKER_TEXT_LEN);
        table_trailer ();

        begin_form (thispage);
        table_header ((const char **) 0, 0);
        begin_table_row (0);
        button_column ("poweron", "Power On", "style=\"width:180px\"");
        button_column ("poweroff", "Power Off", "style=\"width:180px\"");
        end_table_row ();
        begin_table_row (0);
        button_column ("apoweron", "Ambilight Power On", "style=\"width:180px\"");
        button_column ("apoweroff", "Ambilight Power Off", "style=\"width:180px\"");
        end_table_row ();
        begin_table_row (0);
        button_column ("learnir", "Learn IR remote control", "style=\"width:180px\"");
        button_column ("eepromdump", "EEPROM dump", "style=\"width:180px\"");
        end_table_row ();
        begin_table_row (0);
        button_column ("rststm32", "Reset STM32", "style=\"width:180px\"");
        button_column ("rsteeprom", "Reset EEPROM", "style=\"width:180px\"");
        end_table_row ();
        table_trailer ();
        end_form ();

        if (! strcmp (action, "eepromdump"))
        {
            message = "Currently not implemented";
            // http_eeprom_dump ();
        }

        if (message)
        {
            http_send_FS ("<P><font color=green>");
            http_send (message);
            http_send_FS ("</font>\r\n");
        }

        end_box ();
        http_trailer ();
        http_flush ();
    }


    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * network page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_network (void)
{
    const char *                thispage = "network";
    const char *                header_cols[NETWORK_HEADER_COLS] = { "Name", "Value", "Key", "Action" };
    const char *                header_cols2[NETWORK_HEADER_COLS2] = { "Name", "Value", "Action" };
    char *                      action;
    const char *                message = (const char *) 0;
    const char *                alert_message = (const char *) 0;
    const char *                esp_firmware_version;
    char                        timezone_str[16]; // MAX_TIMEZONE_LEN too small
    int                         networks;
    int                         idx;
    uint_fast16_t               utz;
    int_fast16_t                tz;
    uint_fast8_t                observe_summertime;
    STR_VAR *                   sv;
    uint_fast8_t                rtc             = 0;

    esp_firmware_version        = ESP_VERSION;

    utz = get_numvar (TIMEZONE_NUM_VAR);

    tz = utz & 0xFF;

    if (utz & 0x100)
    {
        tz = -tz;
    }

    if (utz & 0x200)
    {
        observe_summertime = 1;
    }
    else
    {
        observe_summertime = 0;
    }

    action = http_get_param ("action");

    if (*action)
    {
        if (! strcmp (action, "savewlanlist"))
        {
            char * ssid = http_get_param ("ssidlist");
            char * key  = http_get_param ("keylist");

            http_header ("Network", (const char *) NULL, (const char *) NULL);
            http_send_FS ("<B>Connecting to Access Point, try again later.</B>");
            http_trailer ();
            http_flush ();

            wifi_connect (ssid, key, true);

            String pssid = ssid;
            String pkey = key;

            if (! pssid.equals (eeprom_ssid))
            {
                pssid.toCharArray(eeprom_ssid, EEPROM_SSID_LEN);
                eeprom_save_ssid ();
            }
    
            if (! pkey.equals (eeprom_ssidkey))
            {
                pkey.toCharArray (eeprom_ssidkey, EEPROM_SSID_KEY_LEN);
                eeprom_save_ssidkey ();
            }
    
            eeprom_flags &= ~EEPROM_FLAG_BOOT_AS_AP;
            eeprom_save_flags ();
            eeprom_commit ();

            return 0;
        }
        else if (! strcmp (action, "savewlan"))
        {
            char * ssid = http_get_param ("ssid");
            char * key  = http_get_param ("key");

            if (strlen (key) < 10)
            {
                alert_message = "Minimum length of key is 10!";
            }
            else
            {
                String  ap_ssid     = ssid;
                String  ap_key      = key;
        
                http_header ("Network", (const char *) NULL, (const char *) NULL);
                http_send_FS ("<B>Restarting as Access Point, try again later.</B>");
                http_trailer ();
                http_flush ();

                if (! ap_ssid.equals (eeprom_ap_ssid))
                {
                    ap_ssid.toCharArray(eeprom_ap_ssid, EEPROM_AP_SSID_LEN);
                    eeprom_save_ap_ssid ();
                }
        
                if (! ap_key.equals (eeprom_ap_ssidkey))
                {
                    ap_key.toCharArray (eeprom_ap_ssidkey, EEPROM_AP_SSID_KEY_LEN);
                    eeprom_save_ap_ssidkey ();
                }
        
                eeprom_flags |= EEPROM_FLAG_BOOT_AS_AP;
                eeprom_save_flags ();
                eeprom_commit ();
        
                wifi_ap (ssid, key);
                return 0;
            }
        }
        else if (! strcmp (action, "savetimeserver"))
        {
            char * newtimeserver = http_get_param ("timeserver");

            set_strvar (TIMESERVER_STR_VAR, newtimeserver);
            message = "Timeserver successfully changed.";
        }
        else if (! strcmp (action, "savetimezone"))
        {
            tz = atoi (http_get_param ("timezone"));

            if (get_numvar (TIMEZONE_NUM_VAR) & 0x200)
            {
                observe_summertime = 1;
            }
            else
            {
                observe_summertime = 0;
            }

            if (tz < 0)
            {
                utz = -tz;
                utz |= 0x100;
            }
            else
            {
                utz = tz;
            }

            if (observe_summertime)
            {
                utz |= 0x200;
            }

            set_numvar (TIMEZONE_NUM_VAR, utz);
            message = "Timezone successfully changed.";
        }
        else if (! strcmp (action, "saveobserve_summertime"))
        {
            utz = get_numvar (TIMEZONE_NUM_VAR);

            observe_summertime = http_get_checkbox_param ("observe_summertime");

            if (observe_summertime)
            {
                utz |= 0x200;
            }
            else
            {
                utz &= ~0x200;
            }

            set_numvar (TIMEZONE_NUM_VAR, utz);
            message = "Summertime observation successfully changed.";
        }
        else if (! strcmp (action, "nettime"))
        {
            message = "Getting net time";
            rpc (GET_NET_TIME_RPC_VAR);
        }
        else if (! strcmp (action, "wps"))
        {
            http_header ("Network", (const char *) NULL, (const char *) NULL);
            http_send_FS ("<B>Connecting to AP via WPS, try again later.</B>");
            http_trailer ();
            http_flush ();

            wifi_wps ();
            return 0;
        }
    }

    if (tz >= 0)
    {
        sprintf (timezone_str, "+%d", tz);
    }
    else
    {
        sprintf (timezone_str, "%d", tz);
    }

    http_header ("Network", (const char *) NULL, (const char *) NULL);
    begin_box ("Network");

    http_send_FS ("<table><tr><td>ESP8266 firmware</td><td>");
    http_send (esp_firmware_version);
    http_send_FS ("</td></tr>\r\n");

    http_send_FS ("<tr><td>IP address</td><td>");
    http_send (wifi_ip_address);
    http_send_FS ("</td></tr></table><P>\r\n");

    table_header (header_cols, NETWORK_HEADER_COLS);

    begin_table_row_form (thispage);
    text_column ("WLAN Client");
    http_send_FS ("<td>");
    networks = WiFi.scanNetworks();
    http_send_FS ("<select id=\"ssidlist\" name=\"ssidlist\">");

