granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    for (idx = 0; idx < networks; ++idx)
    {
        String tmp_ssid = WiFi.SSID(idx);

        http_send_FS ("<option value=\"");
        http_send (tmp_ssid);

        if (! strcmp (wifi_ssid, tmp_ssid.c_str()))
        {
            http_send_FS ("\" selected>");
        }
        else
        {
            http_send_FS ("\">");
        }

        http_send (tmp_ssid);
        http_send_FS ("</option>\r\n");
    }

    http_send_FS ("</select></td><td>");
    input_field ("keylist", "", "", MAX_KEY_LEN, 20);
    http_send_FS ("</td>");
    save_column ("wlanlist");
    end_table_row_form ();

    begin_table_row_form (thispage);
    text_column ("WLAN AP");
    http_send_FS ("<td>");
    input_field ("ssid", "", "", WIFI_MAX_SSID_LEN, 20);
    http_send_FS ("</td><td>");
    input_field ("key", "", "", MAX_KEY_LEN, 20);
    http_send_FS ("</td>");
    save_column ("wlan");
    end_table_row_form ();
    table_trailer ();

    begin_form (thispage);
    button_field ("wps", "WPS");
    end_form ();
    http_send_FS ("<P>");

    table_header (header_cols2, NETWORK_HEADER_COLS2);
    sv = get_strvar (TIMESERVER_STR_VAR);
    table_row_input (thispage, 3, "Time server", "timeserver", sv->str, MAX_IP_LEN);
    table_row_input (thispage, 3, "Time zone (GMT +/-)", "timezone", timezone_str, MAX_TIMEZONE_LEN);
    table_row_checkbox (thispage, "Summertime", "observe_summertime", "Observe summertime", observe_summertime);
    table_trailer ();

    begin_form (thispage);
    button_field ("nettime", "Get net time");
    end_form ();
    http_send_FS ("<P>");

    if (alert_message)
    {
        http_send_FS ("<P><font color=red><B>");
        http_send (alert_message);
        http_send_FS ("</B></font>\r\n");
    }
    else if (message)
    {
        http_send_FS ("<P>\r\n<font color=green>");
        http_send (message);
        http_send_FS ("</font>\r\n");
    }

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * temperature page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_temperature (void)
{
    const char *    thispage = "temperature";
    const char *    header_cols[MAIN_HEADER_COLS]               = { "Name", "Value" };
    char *          action;
    const char *    message                                     = (const char *) 0;
    uint_fast8_t    rtc                                         = 0;
    char            rtc_temp[16];
    int8_t          rtc_temperature_correction;
    int8_t          temperature_correction;
    char            ds18xx_temp[16];
    uint_fast8_t    temp_index;
    uint_fast8_t    rtc_is_up;

    action = http_get_param ("action");

    if (*action)
    {
        if (! strcmp (action, "savetcorrrtc"))
        {
            int temp_index              = (int) get_numvar (RTC_TEMP_INDEX_NUM_VAR);
            int old_correction          = (int) http_decode_temp_correction (get_numvar (RTC_TEMP_CORRECTION_NUM_VAR));
            int temp_corr               = http_clamp_temp_correction (atoi (http_get_param ("tcorrrtc")));

            rtc_temperature_correction = temp_corr;

            temp_index -= (rtc_temperature_correction - old_correction);

            if (temp_index < 0)
            {
                temp_index = 0;
            }
            else if (temp_index > 255)
            {
                temp_index = 255;
            }

            set_numvar (RTC_TEMP_INDEX_NUM_VAR, temp_index);
            set_numvar (RTC_TEMP_CORRECTION_NUM_VAR, http_encode_temp_correction (rtc_temperature_correction));
        }
        else if (! strcmp (action, "savetcorrds18xx"))
        {
            int temp_index              = (int) get_numvar (DS18XX_TEMP_INDEX_NUM_VAR);
            int old_correction          = (int) http_decode_temp_correction (get_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR));
            int temp_corr               = http_clamp_temp_correction (atoi (http_get_param ("tcorrds18xx")));

            temperature_correction = temp_corr;

            temp_index -= (temperature_correction - old_correction);

            if (temp_index < 0)
            {
                temp_index = 0;
            }
            else if (temp_index > 255)
            {
                temp_index = 255;
            }

            set_numvar (DS18XX_TEMP_INDEX_NUM_VAR, temp_index);
            set_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR, http_encode_temp_correction (temperature_correction));
        }
        else if (! strcmp (action, "displaytemperature"))
        {
            message = "Displaying temperature...";
            rpc (DISPLAY_TEMPERATURE_RPC_VAR);
        }
    }

    rtc_is_up = get_numvar (RTC_IS_UP_NUM_VAR);

    if (rtc_is_up)
    {
        temp_index = get_numvar (RTC_TEMP_INDEX_NUM_VAR);
        sprintf (rtc_temp, "%d", temp_index / 2);

        if (temp_index % 2)
        {
            strcat (rtc_temp, ".5");
        }

        strcat (rtc_temp, "&deg;C");
    }
    else
    {
        strcpy (rtc_temp, "offline");
    }

    uint_fast8_t ds18xx_is_up = get_numvar (DS18XX_IS_UP_NUM_VAR);

    if (ds18xx_is_up)
    {
        temp_index = get_numvar (DS18XX_TEMP_INDEX_NUM_VAR);
        sprintf (ds18xx_temp, "%d", temp_index / 2);

        if (temp_index % 2)
        {
            strcat (ds18xx_temp, ".5");
        }

        strcat (ds18xx_temp, "&deg;C");
    }
    else
    {
        strcpy (ds18xx_temp, "offline");
    }

    rtc_temperature_correction = http_decode_temp_correction (get_numvar (RTC_TEMP_CORRECTION_NUM_VAR));
    temperature_correction = http_decode_temp_correction (get_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR));

    http_header ("Temperature", (const char *) NULL, (const char *) NULL);
    begin_box ("Temperature");

    table_header (header_cols, MAIN_HEADER_COLS);
    table_row ("RTC temperature", rtc_temp, "");
    table_row ("DS18xx", ds18xx_temp, "");
    table_row_input (thispage, 3, "Temp correction RTC (units of 0.5&deg;C)", "tcorrrtc", rtc_temperature_correction, MAX_TEMP_CORR_LEN);
    table_row_input (thispage, 3, "Temp correction DS18xx (units of 0.5&deg;C)", "tcorrds18xx", temperature_correction, MAX_TEMP_CORR_LEN);
    table_trailer ();

    begin_form (thispage);
    button_field ("displaytemperature", "Display temperature");
    end_form ();

    if (message)
    {
        http_send_FS ("<P><font color=green>");
        http_send (message);
        http_send_FS ("</font>\r\n");
    }

    end_box ();
    http_trailer ();
    http_flush ();

