granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            if (overlays[idx].date_code == OVERLAY_DATE_CODE_NONE && overlays[idx].date_start == 0)
            {
                text_column ("");
            }
            else
            {
                input_column ("od", "", overlays[idx].days, 2, 2);
            }

            save_column (id);
            begin_column ();
            http_send_FS ("<button type=\"submit\" name=\"action\" value=\"disp");
            http_send (disp);
            http_send_FS ("\">Display</button>");
            end_column ();
            end_table_row_form ();
        }

        table_trailer ();
    }

    if (n_overlays < MAX_OVERLAYS)
    {
        sprintf (id, "oid%d", n_overlays);

        begin_form (thispage);
        http_send_FS ("<table><tr>");
        text_column ("New overlay:");
        select_column ("otype", overlay_types, OVERLAY_TYPE_NONE, 0, N_OVERLAY_TYPES, 0);
        save_column (id);
        http_send_FS ("</tr></table>");
        end_form ();
    }

    if (message)
    {
        http_send_FS ("<P><font color=green>");
        http_send (message);
        http_send_FS ("</font>\r\n");
    }

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * ambilight page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_ambilight (void)
{
    const char *        thispage = "ambilight";
    const char *        header_cols[DISPLAY_HEADER_COLS] = { "Name", "Value", "Action" };
    const char *        ambimode_dec_cols[AMBILIGHT_MODE_DECELERATION_HEADER_COLS] = { "Name", "Deceleration", "Default", "Action" };
    static const char * ambilight_mode_names[MAX_AMBILIGHT_MODE_VARIABLES];
    static uint_fast8_t already_called;
    char *              action;
    const char *        message         = (const char *) 0;
    uint_fast8_t        use_rgbw        = get_numvar (DISPLAY_USE_RGBW_NUM_VAR);
    DSP_COLORS          rgbw;
    DSP_COLORS          rgbw_marker;
    const char *        ids[4]          = { "red", "green", "blue", "white" };
    const char *        marker_ids[4]   = { "mred", "mgreen", "mblue", "mwhite" };
    const char *        desc[4]         = { "R", "G", "B", "W" };
    char *              rgbw_buf[4];
    char *              rgbw_marker_buf[4];
    const char *        minval[4]       = { "0",   "0",  "0",  "0" };
    const char *        maxval[4]       = { "63", "63", "63", "63" };
    char                rbdecbuf[MAX_RAINBOW_DECELERATION_LEN + 1];
    AMBILIGHT_MODE *    am;
    uint_fast8_t        ambilight_brightness;
    uint_fast8_t        auto_brightness_active;
    char                brbuf[MAX_BRIGHTNESS_LEN + 1];
    char                red_buf[MAX_COLOR_VALUE_LEN + 16];
    char                green_buf[MAX_COLOR_VALUE_LEN + 16];
    char                blue_buf[MAX_COLOR_VALUE_LEN + 16];
    char                white_buf[MAX_COLOR_VALUE_LEN + 16];
    char                marker_red_buf[MAX_COLOR_VALUE_LEN + 16];
    char                marker_green_buf[MAX_COLOR_VALUE_LEN + 16];
    char                marker_blue_buf[MAX_COLOR_VALUE_LEN + 16];
    char                marker_white_buf[MAX_COLOR_VALUE_LEN + 16];
    char                ambimode_idbuf[8];
    char                ambimode_decidbuf[8];
    char                ambimode_defaultidbuf[8];
    char                ambimode_decbuf[MAX_AMBILIGHT_MODE_DECELERATION_LEN + 1];
    int                 ambilight_mode;
    int                 ambilight_leds;
    int                 ambilight_offset;
    int                 ambilight_markers = 0;
    uint_fast8_t        display_flags;
    uint_fast8_t        sync_ambilight;
    uint_fast8_t        sync_clock_markers;
    uint_fast8_t        fade_clock_seconds;
    uint_fast8_t        n_colors;
    uint_fast8_t        idx;
    uint_fast8_t        rtc             = 0;

    if (! already_called)
    {
        for (idx = 0; idx < MAX_AMBILIGHT_MODE_VARIABLES; idx++)
        {
            AMBILIGHT_MODE * am = get_ambilight_mode_var ((AMBILIGHT_MODE_VARIABLE) idx);
            ambilight_mode_names[idx] = am->name;
        }
        already_called = 1;
    }

    ambilight_mode          = get_numvar (AMBILIGHT_MODE_NUM_VAR);
    ambilight_leds          = get_numvar (AMBILIGHT_LEDS_NUM_VAR);
    ambilight_offset        = get_numvar (AMBILIGHT_OFFSET_NUM_VAR);
    display_flags           = get_numvar (DISPLAY_FLAGS_NUM_VAR);
    sync_ambilight          = (display_flags & DISPLAY_FLAGS_SYNC_AMBILIGHT) ? 1 : 0;
    sync_clock_markers      = (display_flags & DISPLAY_FLAGS_SYNC_CLOCK_MARKERS) ? 1 : 0;
    fade_clock_seconds      = (display_flags & DISPLAY_FLAGS_FADE_CLOCK_SECONDS) ? 1 : 0;
    ambilight_brightness    = get_numvar (AMBILIGHT_BRIGHTNESS_NUM_VAR);
    auto_brightness_active  = get_numvar (DISPLAY_AUTOMATIC_BRIGHTNESS_ACTIVE_NUM_VAR);
    get_dsp_color_var (AMBILIGHT_DSP_COLOR_VAR, &rgbw);
    get_dsp_color_var (AMBILIGHT_MARKER_DSP_COLOR_VAR, &rgbw_marker);

    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "savesyncambi"))
        {
            if (http_get_checkbox_param ("syncambi"))
            {
                sync_ambilight = 1;
                display_flags |= DISPLAY_FLAGS_SYNC_AMBILIGHT;
            }
            else
            {
                sync_ambilight = 0;
                display_flags &= ~DISPLAY_FLAGS_SYNC_AMBILIGHT;
            }

            set_numvar (DISPLAY_FLAGS_NUM_VAR, display_flags);
        }
        else if (! strcmp (action, "savesyncmark"))
        {
            if (http_get_checkbox_param ("syncmark"))
            {
                sync_clock_markers = 1;
                display_flags |= DISPLAY_FLAGS_SYNC_CLOCK_MARKERS;
            }
            else
            {
                sync_clock_markers = 0;
                display_flags &= ~DISPLAY_FLAGS_SYNC_CLOCK_MARKERS;
            }

            set_numvar (DISPLAY_FLAGS_NUM_VAR, display_flags);
        }
        else if (! strcmp (action, "savefadeclk"))
        {
            if (http_get_checkbox_param ("fadeclk"))
            {
                fade_clock_seconds = 1;
                display_flags |= DISPLAY_FLAGS_FADE_CLOCK_SECONDS;
            }
            else
            {
                fade_clock_seconds = 0;
                display_flags &= ~DISPLAY_FLAGS_FADE_CLOCK_SECONDS;
            }

            set_numvar (DISPLAY_FLAGS_NUM_VAR, display_flags);
        }
        else if (! strcmp (action, "savebrightness"))
        {
            ambilight_brightness = atoi (http_get_param ("brightness"));
            set_numvar (AMBILIGHT_BRIGHTNESS_NUM_VAR, ambilight_brightness);
        }
        else if (! strcmp (action, "savecolors"))
        {
            rgbw.red     = atoi (http_get_param ("red"));
            rgbw.green   = atoi (http_get_param ("green"));
            rgbw.blue    = atoi (http_get_param ("blue"));

