granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    table_trailer ();

    table_header (alarm_header_cols, ALARM_TIMERS_HEADER_COLS);

    for (idx = 0; idx < MAX_ALARM_TIME_VARIABLES; idx++)
    {
        table_row_alarm_timers (thispage, idx);
    }

    table_trailer ();

    table_header (play_track_header_cols, PLAY_TRACK_HEADER_COLS);

    begin_table_row_form (thispage, 0);
    input_column ("plfolder", "",  "", 2, 2);
    input_column ("pltrack",  "",  "", 3, 3);
    button_column ("play", "Play");
    end_table_row_form ();

    table_trailer ();

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * tft page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define SSD1963_GLOBAL_FLAGS_RGB_ORDER          0x01
#define SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL    0x02
#define SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL      0x04
#define SSD1963_GLOBAL_FLAGS_MASK               0x07

#define TFT_HEADER_COLS                         3

static uint_fast8_t
http_tft (void)
{
    const char *    thispage = "tft";
    const char *    tft_header_cols[TFT_HEADER_COLS]           = { "Name", "Value", "Action" };
    uint_fast8_t    flags;
    char *          action;
    uint_fast8_t    rtc = 0;

    flags = get_numvar (SSD1963_FLAGS_NUM_VAR);
    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "saveflags"))
        {
            flags = 0;

            if (http_get_checkbox_param ("rgb"))
            {
                flags |= SSD1963_GLOBAL_FLAGS_RGB_ORDER;
            }
            
            if (http_get_checkbox_param ("hflip"))
            {
                flags |= SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL;
            }

            if (http_get_checkbox_param ("vflip"))
            {
                flags |= SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL;
            }

            set_numvar (SSD1963_FLAGS_NUM_VAR, flags);
        }
    }

    http_header ("TFT", (const char *) NULL, (const char *) NULL);
    begin_box ("TFT");

    table_header (tft_header_cols, TFT_HEADER_COLS);

    begin_table_row_form (thispage);
    text_column ("Color<BR>Hor.<BR>Vert.");
    http_send_FS ("<td align=right>");
    checkbox_field ("rgb", "RGB", (flags & SSD1963_GLOBAL_FLAGS_RGB_ORDER) ? 1 : 0);
    http_send_FS ("<br>");
    checkbox_field ("hflip", "Flip", (flags & SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL) ? 1 : 0);
    http_send_FS ("<br>");
    checkbox_field ("vflip", "Flip", (flags & SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL) ? 1 : 0);
    http_send_FS ("</td>");
    save_column ("flags");
    end_table_row_form ();

    table_trailer ();

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

static bool
download_file_to_local (const char * host, const char * path, const char * remote_filename, const char * local_filename)
{
    int             len;                                                // content len
    bool            rtc = false;

    len = httpclient (host, path, remote_filename);

    if (len > 0)
    {
        int ch;
        int idx = 0;

        File f = LittleFS.open(local_filename, "w");

        if (! f)
        {
            httpclient_stop ();
            return false;
        }

        while (len > 0)
        {
            ch = httpclient_read (&len);

            if (ch < 0)
            {
                break;
            }

            http_download_buf[idx++] = ch;
            if (idx == 1024)
            {
               f.write (http_download_buf, idx);
               idx = 0;
            }
        }

        if (idx > 0)
        {
           f.write (http_download_buf, idx);
        }

        f.close ();
        httpclient_stop ();
        rtc = (len == 0);
    }
    return rtc;
}

static bool
download_file (const char * host, const char * path, const char * filename)
{
    return download_file_to_local (host, path, filename, filename);
}

#define READ_LINE_TIMEOUT   2000  // 2000 msec
#define READ_BODY_TIMEOUT   5000  // 5000 msec

static bool
read_line (String& line)
{
    int c = 0;
    ulong start_millis = 0;
    bool  rtc = true;

    line = "";

    start_millis = millis();

    do
    {
        if (http_client.available())
        {
            start_millis = millis();
            c = http_client.read();
    
            if (c >= 0 && c != '\n' && c != '\r')
            {
                line += (char) c;
            }
        }
        else
        {
            if ((millis() - start_millis) >= READ_LINE_TIMEOUT)
            {
                rtc = false;
                break;
            }
        }
    } while (c >= 0 && c != '\r');

    yield();
    return (rtc);
}

static bool
read_post_headers (size_t * content_length)
{
    String line;

    *content_length = 0;
    http_clear_request_user_agent ();

    while (read_line (line))
    {
        if (line == "")
        {
            if (http_client.available () && http_client.peek () == '\n')
            {
                http_client.read ();
            }
            return true;
        }
        else if (line.startsWith ("Content-Length:"))
        {
            *content_length = (size_t) strtoul (line.substring (15).c_str (), NULL, 10);
        }
        else if (line.startsWith ("User-Agent:"))
        {
            http_capture_request_user_agent (line);
        }
    }

    return false;
}

static bool
read_request_body_to_file (File& f, size_t content_length)
{
    unsigned long start_millis = millis ();

    while (content_length > 0)
    {
        if (http_client.available ())
        {
            uint8_t buf[256];
            size_t  chunk = http_client.available ();

            if (chunk > sizeof (buf))
            {
                chunk = sizeof (buf);
            }

            if (chunk > content_length)
            {
                chunk = content_length;
            }

            int n = http_client.read (buf, chunk);

