granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            if (n > 0)
            {
                f.write (buf, n);
                content_length -= n;
                start_millis = millis ();
                yield ();
            }
        }
        else if ((millis () - start_millis) >= READ_BODY_TIMEOUT)
        {
            return false;
        }
    }

    return true;
}

static size_t
read_request_body_to_update (size_t content_length)
{
    size_t written = 0;
    unsigned long start_millis = millis ();

    while (written < content_length)
    {
        if (http_client.available ())
        {
            uint8_t buf[256];
            size_t  chunk = http_client.available ();

            if (chunk > sizeof (buf))
            {
                chunk = sizeof (buf);
            }

            if (chunk > content_length - written)
            {
                chunk = content_length - written;
            }

            int n = http_client.read (buf, chunk);

            if (n > 0)
            {
                size_t just_written = Update.write (buf, n);

                if (just_written != (size_t) n)
                {
                    return written + just_written;
                }

                written += just_written;
                start_millis = millis ();
                yield ();
            }
        }
        else if ((millis () - start_millis) >= READ_BODY_TIMEOUT)
        {
            return written;
        }
    }

    return written;
}

static size_t
skip_leading_body_newlines (void)
{
    size_t skipped = 0;
    unsigned long start_millis = millis ();

    while ((millis () - start_millis) < READ_BODY_TIMEOUT)
    {
        if (http_client.available ())
        {
            int ch = http_client.peek ();

            if (ch == '\r' || ch == '\n')
            {
                http_client.read ();
                skipped++;
                continue;
            }
            break;
        }
    }

    return skipped;
}

static bool
fs_read_line (File& fp, String& line)
{
    int c;

    line = "";

    while ((c = fp.read ()) >= 0)
    {
        if (c == '\r')
        {
            continue;
        }
        else if (c == '\n')
        {
            return true;
        }

        line += (char) c;
    }

    return line.length () > 0;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * LittleFS page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define FSINFO_HEADER_COLS      2
#define DIRECTORY_HEADER_COLS   2

#define POST_ICON_NONE            0
#define POST_ICON_FILE            1
#define POST_ICON_WEATHER_FILE    2
#define POST_TABLES_FILE          3
#define POST_DISPLAY_FILE         4

static uint_fast8_t
http_fs (int post = POST_ICON_NONE)
{
    const char *    thispage = "fs";
    const char *    update_header_cols[UPDATE_HEADER_COLS]  = { "Name", "Value" };
    const char *    fsinfo_cols[FSINFO_HEADER_COLS]         = { "Parameter", "Value" };
    const char *    directory_cols[DIRECTORY_HEADER_COLS]   = { "File", "Size" };
    char *          action;
    char            valbuf[16];
    const char *    fname_icon      = (const char *) 0;
    const char *    fname_weather   = (const char *) 0;
    const char *    fname_tables    = (const char *) 0;
    const char *    fname_display   = (const char *) 0;
    const char *    show_fname      = (const char *) 0;
    const char *    tables_filter   = (const char *) 0;
    char *          update_host;
    char *          update_path;
    FSInfo          fsinfo;
    int             download_rtc = 2;
    STR_VAR *       sv;
    int             len;
    uint_fast8_t    rtc = 0;

    action = http_get_param ("action");

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon      = "wc24h-icon.txt";
                fname_weather   = "wc24h-weather.txt";
                fname_tables    = "wc24h-tables-local.txt";
                fname_display   = "wc24h-display-local.txt";
                tables_filter   = "wc24h-tables-";
                break;
            case HW_WC_12H:
                fname_icon      = "wc12h-icon.txt";
                fname_weather   = "wc12h-weather.txt";
                fname_tables    = "wc12h-tables-local.txt";
                fname_display   = "wc12h-display-local.txt";
                tables_filter   = "wc12h-tables-";
                break;
            case HW_UCLOCK:
                fname_icon      = "uc-icon.txt";
                fname_weather   = "uc-weather.txt";
                fname_tables    = (const char *) 0;
                fname_display   = (const char *) 0;
                tables_filter   = (const char *) 0;
                break;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    if (post != POST_ICON_NONE)
    {
        File f = (File) 0;
        String line;
        LittleFS.begin();

        if (post == POST_ICON_FILE)
        {
            if (fname_icon)
            {
                f = LittleFS.open(fname_icon, "w+");
            }
        }
        else if (post == POST_ICON_WEATHER_FILE)
        {
            if (fname_weather)
            {
                f = LittleFS.open(fname_weather, "w+");
            }
        }
        else if (post == POST_TABLES_FILE)
        {
            if (fname_tables)
            {
                f = LittleFS.open(fname_tables, "w+");
            }
        }
        else if (post == POST_DISPLAY_FILE)
        {
            if (fname_display)
            {
                f = LittleFS.open(fname_display, "w+");
            }
        }
        if (f)
        {
            // find the line with content type and boundary string
            String boundary;

            while (read_line(line))
            {
                if (line.startsWith("Content-Type:"))
                {
                    int n = line.indexOf("boundary=");
                    if (n > 0)
                    {
                        boundary = "--" + line.substring(n + strlen("boundary="));
                    }
                    break;
                }
            }

            // no boundary? something is wrong
            if (boundary == "")
            {
                http_send("<font color='red'>Wrong http header</font><br/>");
            }
            else
            {
                // read until a boundary has been found
                while (read_line(line) && line != boundary)
                {
                    ;
                }

                // read the empty line
                while (read_line(line) && line != "")
                {
                    ;
                }

                // read and save file content until the boundary has been found
                while (read_line(line))
                {
                    // boundary found, end of file
                    if (line == boundary)
                    {
                        break;
                    }
                    f.write((const unsigned char*)line.c_str(), line.length());
                    f.write('\r');
                    f.write('\n');
                    yield ();
                }
            }

            f.close();
        }
        else
        {
            http_send_FS ("<font color=red>Failed to upload file.</font></B><BR>\r\n");
        }

        LittleFS.end();
    }

    if (action)
    {
        if (! strcmp (action, "format"))
        {
            LittleFS.begin ();
            LittleFS.format ();
            LittleFS.end ();
        }
        else if (! strcmp (action, "saveuphost"))
        {
            set_strvar (UPDATE_HOST_VAR, http_get_param ("uphost"));
        }
        else if (! strcmp (action, "saveuppath"))
        {
            set_strvar (UPDATE_PATH_VAR, http_get_param ("uppath"));
        }
        else if (! strcmp (action, "savedwnfil"))
        {
            char * fname = http_get_param ("dwnfil");

            LittleFS.begin ();
            download_rtc = download_file (update_host, update_path, fname);
            LittleFS.end ();
        }
        else if (! strcmp (action, "dwntable"))
        {
            char * fname = http_get_param ("tablefile");

            LittleFS.begin ();
            download_rtc = download_file (update_host, update_path, fname);
            LittleFS.end ();
            tables_init ();                                                         // reload layout tables
        }
        else if (! strcmp (action, "download"))
        {
            LittleFS.begin ();

            if (fname_icon)
            {
                download_rtc = download_file (update_host, update_path, fname_icon);
            }

