granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
        LittleFS.end ();
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");

    if (! ok)
    {
        http_send (FS(",\"error\":"));
        http_send (String (error_code).c_str ());
        http_send (FS(",\"detail\":\""));

        switch (error_code)
        {
            case 1: http_send (FS("target unavailable")); break;
            case 2: http_send (FS("invalid request")); break;
            case 3: http_send (FS("open failed")); break;
            case 4: http_send (FS("upload failed")); break;
            case 5: http_send (FS("invalid filename")); break;
            default: http_send (FS("unknown error")); break;
        }

        http_send (FS("\""));
    }

    http_send (FS("}"));
    http_flush ();

    return 0;
}

static uint_fast8_t
http_api_app_file_upload ()
{
    const char *    asset_path = http_get_param ("filename");
    const char *    validated_asset = http_find_app_install_asset (asset_path);
    size_t          content_length = 0;
    uint_fast8_t    ok = 0;
    uint32_t        error_code = 0;
    char            local_filename[64];
    unsigned long   step = 0;
    unsigned long   total = 0;
    const char *    step_param = http_get_param ("step");
    const char *    total_param = http_get_param ("total");

    local_filename[0] = '\0';

    if (step_param && *step_param)
    {
        step = strtoul (step_param, (char **) 0, 10);
    }

    if (total_param && *total_param)
    {
        total = strtoul (total_param, (char **) 0, 10);
    }

    if (! validated_asset)
    {
        error_code = 1;
    }
    else if (! read_post_headers (&content_length) || content_length == 0)
    {
        error_code = 3;
    }
    else
    {
        const char * encoding = http_get_param ("encoding");
        uint_fast8_t gzip_encoded = (encoding && ! strcmp (encoding, "gzip")) ? 1 : 0;

        if (! app_asset_storage_filename (validated_asset, gzip_encoded, local_filename, sizeof (local_filename)))
        {
            error_code = 2;
        }
        else
        {
        char stale_filename[64];

        if (app_asset_storage_filename (validated_asset, gzip_encoded ? 0 : 1, stale_filename, sizeof (stale_filename)))
        {
            LittleFS.remove (stale_filename);
        }

        if (step == 1 && total > 0)
        {
            Serial.print (F("APPDL local-install-begin count="));
            Serial.println (total);
        }

        Serial.print (F("APPDL local-install-step "));
        if (step > 0 && total > 0)
        {
            Serial.print (step);
            Serial.print ('/');
            Serial.print (total);
            Serial.print (' ');
        }
        Serial.print (F("remote="));
        Serial.print (validated_asset);
        Serial.print (F(" local="));
        Serial.println (local_filename);

        LittleFS.begin ();

        File f = LittleFS.open (local_filename, "w+");

        if (! f)
        {
            error_code = 4;
        }
        else
        {
            ok = read_request_body_to_file (f, content_length) ? 1 : 0;
            f.close ();

            if (! ok)
            {
                LittleFS.remove (local_filename);
                error_code = 5;
            }
        }

        LittleFS.end ();

        if (ok && total > 0 && step >= total)
        {
            Serial.print (F("APPDL local-install-complete count="));
            Serial.println (total);
        }
        }   // else: app_asset_storage_filename ok
    }   // else: validated_asset && content_length ok

    if (! ok)
    {
        Serial.print (F("APPDL local-install-fail "));
        if (step > 0 && total > 0)
        {
            Serial.print (F("step="));
            Serial.print (step);
            Serial.print ('/');
            Serial.print (total);
            Serial.print (' ');
        }
        if (validated_asset)
        {
            Serial.print (F("remote="));
            Serial.print (validated_asset);
            Serial.print (' ');
        }
        if (local_filename[0])
        {
            Serial.print (F("local="));
            Serial.print (local_filename);
            Serial.print (' ');
        }
        Serial.print (F("error="));
        Serial.println (error_code);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");

    if (! ok)
    {
        http_send (FS(",\"error\":"));
        http_send (String (error_code).c_str ());
        http_send (FS(",\"detail\":\""));

        switch (error_code)
        {
            case 1: http_send (FS("invalid filename")); break;
            case 2: http_send (FS("invalid target")); break;
            case 3: http_send (FS("invalid request")); break;
            case 4: http_send (FS("open failed")); break;
            case 5: http_send (FS("upload failed")); break;
            default: http_send (FS("unknown error")); break;
        }

        http_send (FS("\""));
    }

    http_send (FS("}"));
    http_flush ();

    return 0;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * HTTP update
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_update (void)
{
    const char *        thispage = "update";
    const char *        update_header_cols[UPDATE_HEADER_COLS]               = { "Name", "Value" };
    const char *        refresh_url = "/update";
    char *              action;
    char *              return_to_app;
    char                flash_stm32_filename[MAX_UPDATE_FILENAME_LEN];
    char                stm32_default_filename[MAX_UPDATE_FILENAME_LEN];
    int                 do_update = 0;
    int                 do_reset = 0;
    STR_VAR *           sv;
    char *              version;
    char *              update_host;
    char *              update_path;
    char                flashsizebuf[32];
    uint32_t            flashsize;
    uint_fast8_t        rtc = 0;

    flash_stm32_filename[0] = '\0';

    sv              = get_strvar (VERSION_STR_VAR);
    version         = sv->str;

    flashsize = ESP.getFlashChipRealSize ();
    sprintf (flashsizebuf, "%d", flashsize);

    action = http_get_param ("action");
    return_to_app = http_get_param ("return_to_app");

