granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (return_to_app && ! strcmp (return_to_app, "1"))
    {
        refresh_url = "/app/";
    }

    if (action)
    {
        if (! strcmp (action, "update"))
        {
            do_update = 1;
        }
        else if (! strcmp (action, "saveuphost"))
        {
            set_strvar (UPDATE_HOST_VAR, http_get_param ("uphost"));
        }
        else if (! strcmp (action, "saveuppath"))
        {
            set_strvar (UPDATE_PATH_VAR, http_get_param ("uppath"));
        }
        else if (! strcmp (action, "flash"))
        {
            strncpy (flash_stm32_filename, http_get_param ("stm32_filenames"), 63);
            flash_stm32_filename[63] = '\0';
        }
        else if (! strcmp (action, "reset"))
        {
            do_reset = 1;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    if (do_update)
    {
        http_header ("Update", "40", refresh_url);
    }
    else if (do_reset)
    {
        http_header ("Update", "20", "/");
    }
    else
    {
        http_header ("Update", (const char *) NULL, (const char *) NULL);
    }

    begin_box ("Update");

    if (flashsize >= 4194304)
    {
        if (flash_stm32_filename[0])
        {
            int i;
            bool ok;

            for (i = 0; i < 100; i++)
            {                                                   // send 1000 spaces to force Browser to begin rendering
                http_send ("          "); 
            }

            http_send_FS ("\r\n<P><B>Updating STM32 firmware...<BR>\r\n");
            http_flush ();

            Serial.print ("Flash STM32: http://");
            Serial.print (update_host);
            Serial.print ("/");
            Serial.print (update_path);
            Serial.print ("/");
            Serial.println (flash_stm32_filename);

            delay (200);
            update_progress_begin ("stm32", "starting", "STM32-Update wird vorbereitet.");
            ok = stm32_flash_from_server (update_host, update_path, flash_stm32_filename);
            delay (200);
            Serial.println ("End of flashmode\r\n");
            Serial.flush ();

            if (ok)
            {
                update_progress_complete ("STM32-Flash abgeschlossen. Warte auf Reset.");
            }
            else if (! update_progress.error_code)
            {
                update_progress_fail (1, "STM32-Flash fehlgeschlagen.");
            }

            http_send_FS ("Done. <font color=red>Please Reset your STM32 now!</font></B><BR>\r\n"
                          "<form method=\"GET\" action=\"/update\">\r\n"
                          "<button type=\"submit\" name=\"action\" value=\"reset\">Reset STM32</button>"
                          "</form>"
                          "<P>\r\n");
            end_box ();
            http_trailer ();
            http_flush ();
        }
        else if (do_reset)
        {
            update_progress_state ("reset", "STM32 wird zurückgesetzt.");
            http_send_FS ("<P><B>Resetting STM32, reconnecting in 20 seconds ...</B><BR>\r\n");
            end_box ();
            http_trailer ();
            http_flush ();
            delay (200);
            stm32_reset ();
            update_progress_complete ("STM32 wurde zurückgesetzt.");
        }
        else
        {
            if (do_update)
            {
                char path[MAX_UPDATE_HOST_LEN + MAX_UPDATE_PATH_LEN + MAX_UPDATE_FILENAME_LEN + 3];
    
                sprintf (path, "/%s/%s", update_path, ESP_WORDCLOCK_BIN);
                update_progress_begin ("esp", "starting", "ESP-Firmware-Update wird gestartet.");
    
                http_send_FS ("<P><B>Updating ESP firmware '");
                http_send (path);
                http_send_FS ("', reconnecting in 40 seconds ...</B></BR>\r\n");
                end_box ();
                http_trailer ();
                http_flush ();
                while (http_client.available())  // firefox claims about connection reset, if we do not read all characters
                {
                    http_client.read();
                }
                http_client.stop();
                delay (200);
                update_progress_state ("reconnect_wait", "ESP-Firmware wird geladen. Gerät startet danach neu.");
    
                t_httpUpdate_return ret = ESPhttpUpdate.update (http_client, update_host, 80, path);
    
                switch(ret)
                {
                    case HTTP_UPDATE_FAILED:
                        Serial.println("HTTP update: failed");
                        update_progress_fail (ESPhttpUpdate.getLastError (), ESPhttpUpdate.getLastErrorString ().c_str ());
                        break;
    
                    case HTTP_UPDATE_NO_UPDATES:
                        Serial.println("HTTP update: no updates");
                        update_progress_complete ("Keine neue ESP-Firmware verfügbar.");
                        break;
    
                    case HTTP_UPDATE_OK:
                        Serial.println("HTTP update: ok");    // will be never called, because we are rebooting
                        break;
                }
            }
            else
            {
                char    new_esp_version[16];
                char    new_wc_version[16];
                int     len;
    
                new_esp_version[0] = '\0';
                new_wc_version[0] = '\0';
    
                len = httpclient (update_host, update_path, ESP_WORDCLOCK_TXT);
    
                if (len > 0)
                {
                    int ch;
                    int l = 0;
    
                    while (len > 0)
                    {
                        ch = httpclient_read (&len);
    
                        if (ch != '\r' && ch != '\n' && l < 16 - 1)
                        {
                            new_esp_version[l++] = ch;
                        }
                    }
    
