granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
                    httpclient_stop ();
                    new_esp_version[l] = '\0';
                }
                else
                {
                   Serial.print("Error in HTTP request: ");
                   Serial.println(ESP_WORDCLOCK_TXT);
                }
    
                len = httpclient (update_host, update_path, RELEASENOTE_HTML);
    
                if (len > 0)
                {
                    char linebuf[128];
                    int l = 0;
                    int ch;
    
                    while (len > 0)
                    {
                        ch = httpclient_read (&len);
    
                        if (l < 128 - 1 && ch > 0)
                        {
                            linebuf[l++] = ch;
                        }
    
                        if (ch == '\n')
                        {
                            linebuf[l] = '\0';
                            l = 0;
                            http_send (linebuf);
                        }
                    }
    
                    httpclient_stop ();
                }
                else
                {
                   Serial.print("Error in HTTP request: ");
                   Serial.println(RELEASENOTE_HTML);
                }
    
                len = httpclient (update_host, update_path, WC_TXT);
    
                if (len > 0)
                {
                    int ch;
                    int l = 0;
    
                    while (len > 0)
                    {
                        ch = httpclient_read (&len);
    
                        if (ch != '\r' && ch != '\n' && l < 16 - 1)
                        {
                            new_wc_version[l++] = ch;
                        }
                    }
    
                    httpclient_stop ();
                    new_wc_version[l] = '\0';
                }
                else
                {
                   Serial.print("Error in HTTP request: ");
                   Serial.println(WC_TXT);
                }
    
                table_header (update_header_cols, UPDATE_HEADER_COLS);
                table_row_input (thispage, 3, "Update Host", "uphost", update_host, MAX_UPDATE_HOST_LEN, 0);
                table_row_input (thispage, 3, "Update Path", "uppath", update_path, MAX_UPDATE_PATH_LEN, 0);
                table_trailer ();
    
                http_send_FS ("<table><tr><td>ESP8266 flash size</td><td>");
                http_send (flashsizebuf);
                http_send_FS ("</td></tr><tr><td>ESP firmware version</td><td>");
                http_send (ESP_VERSION);
                http_send_FS ("</td></tr>\r\n"
                              "<tr><td>ESP firmware available</td><td>");
                http_send (new_esp_version);
                http_send_FS ("</td></tr></table>\r\n");
    
                http_send_FS ("<form method=\"GET\" action=\"/update\">\r\n"
                              "    <button type=\"submit\" name=\"action\" value=\"update\">Update ESP Firmware</button>"
                              "</form>"
                              "<P>"
                              "<table>"
                              "<tr>"
                              "<td>WordClock firmware version</td>"
                              "<td>");

                http_send (version);
                http_send_FS ("</td>"
                              "</tr>"
                              "<tr>"
                              "<td>WordClock firmware available</td>"
                              "<td>");
                http_send (new_wc_version);
                http_send_FS ("</td>"
                              "</tr>"
                              "</table>"
                              "<form method=\"GET\" action=\"/update\">"
                              "<select id=\"stm32_filenames\" name=\"stm32_filenames\">");
    
                len = httpclient (update_host, update_path, WC_LIST_TXT);
    
                if (len > 0)
                {
                    char fname[MAX_UPDATE_FILENAME_LEN];
                    const char * filter = NULL;
                    int ch;
                    int l = 0;
    
                    stm32_default_filename[0] = '\0';

                    if (hardware_configuration != 0xFFFF)
                    {
                        switch (hardware_configuration & HW_WC_MASK)
                        {
                            case HW_WC_24H:                       strcat (stm32_default_filename, "wc24h-");          break;
                            case HW_WC_12H:                       strcat (stm32_default_filename, "wc12h-");          break;
                            case HW_UCLOCK:                       strcat (stm32_default_filename, "uc-");             break;
                        }

                        switch (hardware_configuration & HW_STM32_MASK)
                        {
                            case HW_STM32_F103C8:                 strcat (stm32_default_filename, "stm32f103-");        filter = "stm32f103-"; break;
                            case HW_STM32_F401RE:                 strcat (stm32_default_filename, "stm32f401-");        filter = "stm32f401-"; break;
                            case HW_STM32_F411RE:                 strcat (stm32_default_filename, "stm32f411-");        filter = "stm32f411-"; break;
                            case HW_STM32_F446RE:                 strcat (stm32_default_filename, "stm32f446-");        filter = "stm32f446-"; break;
                            case HW_STM32_F407VE:                 strcat (stm32_default_filename, "stm32f407-");        filter = "stm32f407-"; break;
                            case HW_STM32_F401CC:
                            {
                                switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
                                {
                                    case HW_OSC_FREQUENCY_8MHZ:   strcat (stm32_default_filename, "stm32f401cc-8-");    filter = "stm32f401cc-8-";    break;
                                    case HW_OSC_FREQUENCY_25MHZ:  strcat (stm32_default_filename, "stm32f401cc-25-");   filter = "stm32f401cc-25-";   break;
                                }
                                break;
                            }
                            case HW_STM32_F411CE:
                            {
                                switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
                                {
                                    case HW_OSC_FREQUENCY_8MHZ:   strcat (stm32_default_filename, "stm32f411ce-8-");    filter = "stm32f411ce-8-";    break;
                                    case HW_OSC_FREQUENCY_25MHZ:  strcat (stm32_default_filename, "stm32f411ce-25-");   filter = "stm32f411ce-25-";   break;
                                }
                                break;
                            }
                        }
        
                        switch (hardware_configuration & HW_LED_MASK)
                        {
                            case HW_LED_WS2812_GRB_LED:     strcat (stm32_default_filename, "ws2812-grb.hex");  break;
                            case HW_LED_WS2812_RGB_LED:     strcat (stm32_default_filename, "ws2812-rgb.hex");  break;
                            case HW_LED_APA102_RGB_LED:     strcat (stm32_default_filename, "apa102-grb.hex");  break;
                            case HW_LED_SK6812_RGB_LED:     strcat (stm32_default_filename, "sk6812-rgb.hex");  break;
                            case HW_LED_SK6812_RGBW_LED:    strcat (stm32_default_filename, "sk6812-rgbw.hex"); break;
                            case HW_LED_TFTLED_RGB_LED:     strcat (stm32_default_filename, "tftled-rgb.hex");  break;
                        }
                    }

                    if (hardware_configuration == 0xFFFF)
                    {
                        http_send_FS ("<option value=\"\" selected>&lt;unknown&gt;</option>\r\n");
                    }

                    while (len > 0)
                    {
                        ch = httpclient_read (&len);
    
