granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_weather_get_forecast ()
{
    rpc (GET_WEATHER_FC_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_scan ()
{
    int networks;
    int idx;

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ssid\":\""));
    http_send (sanitize_xml_string(wifi_ssid).c_str());
    http_send (FS("\",\"ip\":\""));
    http_send (sanitize_xml_string(wifi_ip_address).c_str());
    http_send (FS("\",\"mode\":\""));
    http_send (wifi_ap_mode ? "ap" : "client");
    http_send (FS("\",\"networks\":["));

    networks = WiFi.scanNetworks();

    for (idx = 0; idx < networks; idx++)
    {
        if (idx)
        {
            http_send (FS(","));
        }

        http_send (FS("\""));
        http_send (sanitize_xml_string(WiFi.SSID(idx)).c_str());
        http_send (FS("\""));
    }

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static int
http_api_network_client_set ()
{
    char * ssid = http_get_param ("ssid");
    char * key  = http_get_param ("key");

    if (! ssid)
    {
        ssid = (char *) "";
    }

    if (! key)
    {
        key = (char *) "";
    }

    wifi_connect (ssid, key, true);

    String pssid = ssid;
    String pkey = key;

    if (! pssid.equals (eeprom_ssid))
    {
        pssid.toCharArray (eeprom_ssid, EEPROM_SSID_LEN);
        eeprom_save_ssid ();
    }

    if (! pkey.equals (eeprom_ssidkey))
    {
        pkey.toCharArray (eeprom_ssidkey, EEPROM_SSID_KEY_LEN);
        eeprom_save_ssidkey ();
    }

    eeprom_flags &= ~EEPROM_FLAG_BOOT_AS_AP;
    eeprom_save_flags ();
    eeprom_commit ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_ap_set ()
{
    char * ssid = http_get_param ("ssid");
    char * key  = http_get_param ("key");

    if (! ssid)
    {
        ssid = (char *) "";
    }

    if (! key)
    {
        key = (char *) "";
    }

    if (strlen (key) >= 10)
    {
        String ap_ssid = ssid;
        String ap_key  = key;

        if (! ap_ssid.equals (eeprom_ap_ssid))
        {
            ap_ssid.toCharArray (eeprom_ap_ssid, EEPROM_AP_SSID_LEN);
            eeprom_save_ap_ssid ();
        }

        if (! ap_key.equals (eeprom_ap_ssidkey))
        {
            ap_key.toCharArray (eeprom_ap_ssidkey, EEPROM_AP_SSID_KEY_LEN);
            eeprom_save_ap_ssidkey ();
        }

        eeprom_flags |= EEPROM_FLAG_BOOT_AS_AP;
        eeprom_save_flags ();
        eeprom_commit ();

        wifi_ap (ssid, key);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_eeprom_settings ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ssid\":\""));
    http_send (sanitize_json_string (eeprom_ssid).c_str ());
    http_send (FS("\",\"key\":\""));
    http_send (sanitize_json_string (eeprom_ssidkey).c_str ());
    http_send (FS("\",\"ap_ssid\":\""));
    http_send (sanitize_json_string (eeprom_ap_ssid).c_str ());
    http_send (FS("\",\"ap_key\":\""));
    http_send (sanitize_json_string (eeprom_ap_ssidkey).c_str ());
    http_send (FS("\",\"flags\":"));
    http_send (eeprom_flags ? "1" : "0");
    http_send (FS(",\"boot_as_ap\":"));
    http_send ((eeprom_flags & EEPROM_FLAG_BOOT_AS_AP) ? "true" : "false");
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_eeprom_settings_set ()
{
    char * ssid = http_get_param ("ssid");
    char * key = http_get_param ("key");
    char * ap_ssid = http_get_param ("ap_ssid");
    char * ap_key = http_get_param ("ap_key");
    char * boot_as_ap = http_get_param ("boot_as_ap");

    if (! ssid)     { ssid = (char *) ""; }
    if (! key)      { key = (char *) ""; }
    if (! ap_ssid)  { ap_ssid = (char *) ""; }
    if (! ap_key)   { ap_key = (char *) ""; }

    String pssid = ssid;
    String pkey = key;
    String pap_ssid = ap_ssid;
    String pap_key = ap_key;

    if (! pssid.equals (eeprom_ssid))
    {
        pssid.toCharArray (eeprom_ssid, EEPROM_SSID_LEN);
        eeprom_save_ssid ();
    }

    if (! pkey.equals (eeprom_ssidkey))
    {
        pkey.toCharArray (eeprom_ssidkey, EEPROM_SSID_KEY_LEN);
        eeprom_save_ssidkey ();
    }

    if (! pap_ssid.equals (eeprom_ap_ssid))
    {
        pap_ssid.toCharArray (eeprom_ap_ssid, EEPROM_AP_SSID_LEN);
        eeprom_save_ap_ssid ();
    }

    if (! pap_key.equals (eeprom_ap_ssidkey))
    {
        pap_key.toCharArray (eeprom_ap_ssidkey, EEPROM_AP_SSID_KEY_LEN);
        eeprom_save_ap_ssidkey ();
    }

    if (boot_as_ap && ! strcmp (boot_as_ap, "on"))
    {
        eeprom_flags |= EEPROM_FLAG_BOOT_AS_AP;
    }
    else
    {
        eeprom_flags &= ~EEPROM_FLAG_BOOT_AS_AP;
    }

    eeprom_save_flags ();
    eeprom_commit ();

    http_json_ok ();

    return 0;
}

static int
http_api_network_timeserver_set ()
{
    char * value = http_get_param ("value");

    set_strvar (TIMESERVER_STR_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_timezone_set ()
{
    char * value = http_get_param ("value");
    int tz = atoi (value ? value : "0");
    uint_fast16_t utz = 0;

    if (tz < 0)
    {
        utz = -tz;
        utz |= 0x100;
    }
    else
    {
        utz = tz;
    }

    if (get_numvar (TIMEZONE_NUM_VAR) & 0x200)
    {
        utz |= 0x200;
    }

    set_numvar (TIMEZONE_NUM_VAR, utz);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

