granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_network_summertime_set ()
{
    char * value = http_get_param ("value");
    uint_fast16_t utz = get_numvar (TIMEZONE_NUM_VAR);

    if (value && ! strcmp (value, "on"))
    {
        utz |= 0x200;
    }
    else
    {
        utz &= ~0x200;
    }

    set_numvar (TIMEZONE_NUM_VAR, utz);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_get_time ()
{
    rpc (GET_NET_TIME_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_network_wps ()
{
    wifi_wps ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_update_host_set ()
{
    char * value = http_get_param ("value");

    set_strvar (UPDATE_HOST_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_update_path_set ()
{
    char * value = http_get_param ("value");

    set_strvar (UPDATE_PATH_VAR, value ? value : "");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_update_download_assets ()
{
    const char * fname_icon = (const char *) 0;
    const char * fname_weather = (const char *) 0;
    int download_rtc = 2;
    STR_VAR * sv;
    char * update_host;
    char * update_path;

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon = "wc24h-icon.txt";
                fname_weather = "wc24h-weather.txt";
                break;
            case HW_WC_12H:
                fname_icon = "wc12h-icon.txt";
                fname_weather = "wc12h-weather.txt";
                break;
            case HW_UCLOCK:
                fname_icon = "uc-icon.txt";
                fname_weather = "uc-weather.txt";
                break;
        }
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;
    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    LittleFS.begin ();

    if (fname_icon)
    {
        download_rtc = download_file (update_host, update_path, fname_icon);
    }

    if (fname_weather)
    {
        download_rtc = download_file (update_host, update_path, fname_weather);
    }

    LittleFS.end ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (download_rtc == 1 ? "true" : "false");
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_update_download_table ()
{
    STR_VAR *       sv;
    char *          update_host;
    char *          update_path;
    char *          filename = http_get_param ("filename");
    int             download_rtc = 0;

    if (! http_table_download_filename_matches (filename))
    {
        http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
        http_send (FS("{\"ok\":false,\"error\":\"invalid_filename\"}"));
        http_flush ();
        return 0;
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    LittleFS.begin ();
    download_rtc = download_file (update_host, update_path, filename);
    LittleFS.end ();

    if (download_rtc == 1)
    {
        tables_init ();
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (download_rtc == 1 ? "true" : "false");

    if (download_rtc != 1)
    {
        http_send (FS(",\"error\":\"download_failed\""));
    }

    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_maintenance_format_fs ()
{
    LittleFS.begin ();
    LittleFS.format ();
    LittleFS.end ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_maintenance_reset_stm32 ()
{
    update_progress_state ("reset", "STM32 wird zurückgesetzt.");
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();
    delay (200);
    stm32_reset ();
    update_progress_complete ("STM32 wurde zurückgesetzt.");

    return 0;
}

static int
http_api_maintenance_reset_eeprom ()
{
    rpc (RESET_EEPROM_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_datetime_set ()
{
    TM  tm;
    int year = atoi (http_get_param ("year"));
    int month = atoi (http_get_param ("month"));
    int day = atoi (http_get_param ("day"));
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (year < 2000)
    {
        year = 2000;
    }
    else if (year > 2999)
    {
        year = 2999;
    }

    if (month < 1)
    {
        month = 1;
    }
    else if (month > 12)
    {
        month = 12;
    }

    if (day < 1)
    {
        day = 1;
    }
    else if (day > 31)
    {
        day = 31;
    }

