granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (hour < 0)
    {
        hour = 0;
    }
    else if (hour > 23)
    {
        hour = 23;
    }

    if (minute < 0)
    {
        minute = 0;
    }
    else if (minute > 59)
    {
        minute = 59;
    }

    tm.tm_year = year - 1900;
    tm.tm_mon = month - 1;
    tm.tm_mday = day;
    tm.tm_hour = hour;
    tm.tm_min = minute;
    tm.tm_sec = 0;
    tm.tm_wday = dayofweek (day, month, year);

    set_tm_var (CURRENT_TM_VAR, &tm);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_learn_ir ()
{
    rpc (LEARN_IR_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_display ()
{
    rpc (DISPLAY_TEMPERATURE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_rtc_correction_set ()
{
    int temp_index = (int) get_numvar (RTC_TEMP_INDEX_NUM_VAR);
    int old_correction = (int) http_decode_temp_correction (get_numvar (RTC_TEMP_CORRECTION_NUM_VAR));
    int temp_corr = http_clamp_temp_correction (atoi (http_get_param ("value")));

    temp_index -= (temp_corr - old_correction);

    if (temp_index < 0)
    {
        temp_index = 0;
    }
    else if (temp_index > 255)
    {
        temp_index = 255;
    }

    numvars[RTC_TEMP_INDEX_NUM_VAR] = temp_index;
    set_numvar (RTC_TEMP_CORRECTION_NUM_VAR, http_encode_temp_correction (temp_corr));

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_ds18xx_correction_set ()
{
    int temp_index = (int) get_numvar (DS18XX_TEMP_INDEX_NUM_VAR);
    int old_correction = (int) http_decode_temp_correction (get_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR));
    int temp_corr = http_clamp_temp_correction (atoi (http_get_param ("value")));

    temp_index -= (temp_corr - old_correction);

    if (temp_index < 0)
    {
        temp_index = 0;
    }
    else if (temp_index > 255)
    {
        temp_index = 255;
    }

    numvars[DS18XX_TEMP_INDEX_NUM_VAR] = temp_index;
    set_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR, http_encode_temp_correction (temp_corr));

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_min_set ()
{
    rpc (LDR_MIN_VALUE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_min_value_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }

    set_numvar (LDR_MIN_VALUE_NUM_VAR, value);
    http_json_ok ();

    return 0;
}

static int
http_api_ldr_max_set ()
{
    rpc (LDR_MAX_VALUE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_max_value_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }

    set_numvar (LDR_MAX_VALUE_NUM_VAR, value);
    http_json_ok ();

    return 0;
}

static int
http_api_animation_mode_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }
    else if (value >= max_display_animation_variables)
    {
        value = max_display_animation_variables ? max_display_animation_variables - 1 : 0;
    }

    set_numvar (ANIMATION_MODE_NUM_VAR, value);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_color_animation_mode_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }
    else if (value >= MAX_COLOR_ANIMATION_VARIABLES)
    {
        value = MAX_COLOR_ANIMATION_VARIABLES - 1;
    }

    set_numvar (COLOR_ANIMATION_MODE_NUM_VAR, value);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_animation_profile_set ()
{
    uint_fast8_t idx = atoi (http_get_param ("idx"));
    uint_fast8_t deceleration = atoi (http_get_param ("deceleration"));
    uint_fast8_t favourite = 0;

    if (idx < max_display_animation_variables)
    {
        DISPLAY_ANIMATION * da = get_display_animation_var (idx);

        if (deceleration >= ANIMATION_MIN_DECELERATION && deceleration <= ANIMATION_MAX_DECELERATION)
        {
            set_display_animation_deceleration (idx, deceleration);
        }

        favourite = (http_get_param ("favourite") && ! strcmp (http_get_param ("favourite"), "on")) ? 1 : 0;

        if (favourite)
        {
            set_display_animation_flags (idx, da->flags | ANIMATION_FLAG_FAVOURITE);
        }
        else
        {
            set_display_animation_flags (idx, da->flags & ~ANIMATION_FLAG_FAVOURITE);
        }
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_animation_profile_default ()
{
    uint_fast8_t idx = atoi (http_get_param ("idx"));

    if (idx < max_display_animation_variables)
    {
        DISPLAY_ANIMATION * da = get_display_animation_var (idx);
        set_display_animation_deceleration (idx, da->default_deceleration);
        set_display_animation_flags (idx, da->flags | ANIMATION_FLAG_FAVOURITE);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

