granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_color_animation_profile_set ()
{
    uint_fast8_t idx = atoi (http_get_param ("idx"));
    uint_fast8_t deceleration = atoi (http_get_param ("deceleration"));

    if (idx < MAX_COLOR_ANIMATION_VARIABLES && deceleration <= COLOR_ANIMATION_MAX_DECELERATION)
    {
        set_color_animation_deceleration ((COLOR_ANIMATION_VARIABLE) idx, deceleration);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_color_animation_profile_default ()
{
    COLOR_ANIMATION_VARIABLE idx = (COLOR_ANIMATION_VARIABLE) atoi (http_get_param ("idx"));

    if (idx < MAX_COLOR_ANIMATION_VARIABLES)
    {
        COLOR_ANIMATION * ca = get_color_animation_var (idx);
        set_color_animation_deceleration (idx, ca->default_deceleration);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_display_dim_level_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int value = atoi (http_get_param ("value"));

    if (idx >= 0 && idx <= MAX_BRIGHTNESS)
    {
        if (value < 0)
        {
            value = 0;
        }
        else if (value > 15)
        {
            value = 15;
        }

        set_num8_array (DISPLAY_DIMMED_DISPLAY_COLORS, idx, value);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_dim_level_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int value = atoi (http_get_param ("value"));

    if (idx >= 0 && idx <= MAX_BRIGHTNESS)
    {
        if (value < 0)
        {
            value = 0;
        }
        else if (value > 15)
        {
            value = 15;
        }

        set_num8_array (DISPLAY_DIMMED_AMBILIGHT_COLORS, idx, value);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_tft_flags_set ()
{
    uint_fast8_t flags = 0;

    if (http_get_param ("rgb") && ! strcmp (http_get_param ("rgb"), "on"))
    {
        flags |= SSD1963_GLOBAL_FLAGS_RGB_ORDER;
    }

    if (http_get_param ("hflip") && ! strcmp (http_get_param ("hflip"), "on"))
    {
        flags |= SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL;
    }

    if (http_get_param ("vflip") && ! strcmp (http_get_param ("vflip"), "on"))
    {
        flags |= SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL;
    }

    set_numvar (SSD1963_FLAGS_NUM_VAR, flags);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_display_use_rgbw_set ()
{
    uint_fast8_t use_rgbw = http_get_on_off_value ("value", get_numvar (DISPLAY_USE_RGBW_NUM_VAR));

    set_numvar (DISPLAY_USE_RGBW_NUM_VAR, use_rgbw ? 1 : 0);
    http_json_ok ();

    return 0;
}

static int
http_api_ambilight_brightness_set ()
{
    char * value = http_get_param ("value");
    int    brightness = atoi (value ? value : "0");

    if (brightness < 0)
    {
        brightness = 0;
    }
    else if (brightness > 15)
    {
        brightness = 15;
    }

    set_numvar (AMBILIGHT_BRIGHTNESS_NUM_VAR, brightness);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_brightness\":"));
    char buf[8];
    sprintf (buf, "%d", brightness);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_mode_set ()
{
    char * value = http_get_param ("value");
    int    mode = atoi (value ? value : "0");

    if (mode < 0)
    {
        mode = 0;
    }
    else if (mode >= MAX_AMBILIGHT_MODE_VARIABLES)
    {
        mode = MAX_AMBILIGHT_MODE_VARIABLES - 1;
    }

    set_numvar (AMBILIGHT_MODE_NUM_VAR, mode);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_mode\":"));
    char buf[8];
    sprintf (buf, "%d", mode);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_leds_set ()
{
    char * value = http_get_param ("value");
    int    leds = atoi (value ? value : "0");

    if (leds < 0)
    {
        leds = 0;
    }
    else if (leds > 999)
    {
        leds = 999;
    }

    set_numvar (AMBILIGHT_LEDS_NUM_VAR, leds);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_leds\":"));
    char buf[8];
    sprintf (buf, "%d", leds);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_offset_set ()
{
    char * value = http_get_param ("value");
    int    offset = atoi (value ? value : "0");

    if (offset < 0)
    {
        offset = 0;
    }
    else if (offset > 999)
    {
        offset = 999;
    }

    set_numvar (AMBILIGHT_OFFSET_NUM_VAR, offset);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_offset\":"));
    char buf[8];
    sprintf (buf, "%d", offset);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_mode_profile_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int deceleration = atoi (http_get_param ("deceleration"));

    if (idx >= 0 && idx < MAX_AMBILIGHT_MODE_VARIABLES)
    {
        if (deceleration < 0)
        {
            deceleration = 0;
        }
        else if (deceleration > AMBILIGHT_MODE_MAX_DECELERATION)
        {
            deceleration = AMBILIGHT_MODE_MAX_DECELERATION;
        }

        set_ambilight_mode_deceleration ((AMBILIGHT_MODE_VARIABLE) idx, deceleration);
    }

    http_json_ok ();

