granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_ambilight_mode_profile_default ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_AMBILIGHT_MODE_VARIABLES)
    {
        AMBILIGHT_MODE * am = get_ambilight_mode_var ((AMBILIGHT_MODE_VARIABLE) idx);

        if (am)
        {
            set_ambilight_mode_deceleration ((AMBILIGHT_MODE_VARIABLE) idx, am->default_deceleration);
        }
    }

    http_json_ok ();

    return 0;
}

static void
http_json_ok ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();
}

static uint_fast8_t
http_get_on_off_value (const char * param, uint_fast8_t current_value)
{
    char * value = http_get_param (param);

    if (value && ! strcmp (value, "on"))
    {
        return 1;
    }
    else if (value && ! strcmp (value, "off"))
    {
        return 0;
    }

    return current_value;
}

static uint_fast8_t
http_get_color_component (const char * param)
{
    char * value = http_get_param (param);
    int    component = atoi (value ? value : "0");

    if (component < 0)
    {
        component = 0;
    }
    else if (component > 63)
    {
        component = 63;
    }

    return component;
}

static int
http_api_set_dsp_color (DSP_COLOR_VARIABLE var)
{
    DSP_COLORS   rgbw;
    uint_fast8_t use_rgbw = get_numvar (DISPLAY_USE_RGBW_NUM_VAR);

    rgbw.red     = http_get_color_component ("red");
    rgbw.green   = http_get_color_component ("green");
    rgbw.blue    = http_get_color_component ("blue");
    rgbw.white   = use_rgbw ? http_get_color_component ("white") : 0;

    set_dsp_color_var (var, &rgbw, use_rgbw);
    http_json_ok ();

    return 0;
}

static int
http_api_display_color_set ()
{
    return http_api_set_dsp_color (DISPLAY_DSP_COLOR_VAR);
}

static int
http_api_ambilight_color_set ()
{
    return http_api_set_dsp_color (AMBILIGHT_DSP_COLOR_VAR);
}

static int
http_api_marker_color_set ()
{
    return http_api_set_dsp_color (AMBILIGHT_MARKER_DSP_COLOR_VAR);
}

static int
http_api_live_display_color ()
{
    DSP_COLORS rgbw;
    char       buf[160];

    get_dsp_color_var (DISPLAY_DSP_COLOR_VAR, &rgbw);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    sprintf (buf,
             FS("{\"ok\":true,\"red\":%d,\"green\":%d,\"blue\":%d,\"white\":%d}"),
             rgbw.red,
             rgbw.green,
             rgbw.blue,
             rgbw.white);
    http_send (buf);
    http_flush ();

    return 0;
}

static int
http_api_sync_ambilight_set ()
{
    uint_fast8_t flags = get_numvar (DISPLAY_FLAGS_NUM_VAR);

    if (http_get_on_off_value ("value", flags & DISPLAY_FLAGS_SYNC_AMBILIGHT))
    {
        flags |= DISPLAY_FLAGS_SYNC_AMBILIGHT;
    }
    else
    {
        flags &= ~DISPLAY_FLAGS_SYNC_AMBILIGHT;
    }

    set_numvar (DISPLAY_FLAGS_NUM_VAR, flags);
    http_json_ok ();

    return 0;
}

static int
http_api_sync_markers_set ()
{
    uint_fast8_t flags = get_numvar (DISPLAY_FLAGS_NUM_VAR);

    if (http_get_on_off_value ("value", flags & DISPLAY_FLAGS_SYNC_CLOCK_MARKERS))
    {
        flags |= DISPLAY_FLAGS_SYNC_CLOCK_MARKERS;
    }
    else
    {
        flags &= ~DISPLAY_FLAGS_SYNC_CLOCK_MARKERS;
    }

    set_numvar (DISPLAY_FLAGS_NUM_VAR, flags);
    http_json_ok ();

    return 0;
}

static int
http_api_fade_clock_seconds_set ()
{
    uint_fast8_t flags = get_numvar (DISPLAY_FLAGS_NUM_VAR);

    if (http_get_on_off_value ("value", flags & DISPLAY_FLAGS_FADE_CLOCK_SECONDS))
    {
        flags |= DISPLAY_FLAGS_FADE_CLOCK_SECONDS;
    }
    else
    {
        flags &= ~DISPLAY_FLAGS_FADE_CLOCK_SECONDS;
    }

    set_numvar (DISPLAY_FLAGS_NUM_VAR, flags);
    http_json_ok ();

    return 0;
}

static int
http_api_ambilight_markers_set ()
{
    AMBILIGHT_MODE * am = get_ambilight_mode_var (CLOCK_AMBILIGHT_MODE_VAR);
    uint_fast8_t     flags = am ? am->flags : 0;

    if (http_get_on_off_value ("value", flags & AMBILIGHT_FLAG_SECONDS_MARKER))
    {
        flags |= AMBILIGHT_FLAG_SECONDS_MARKER;
    }
    else
    {
        flags &= ~AMBILIGHT_FLAG_SECONDS_MARKER;
    }

    set_ambilight_mode_flags (CLOCK_AMBILIGHT_MODE_VAR, flags);
    http_json_ok ();

    return 0;
}

static int
http_api_ambilight_online_set ()
{
    char * value = http_get_param ("value");

    if (value && ! strcmp (value, "on"))
    {
        set_numvar (AMBILIGHT_IS_UP_NUM_VAR, 1);
    }
    else if (value && ! strcmp (value, "off"))
    {
        set_numvar (AMBILIGHT_IS_UP_NUM_VAR, 0);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_online\":\""));
    http_send (get_numvar (AMBILIGHT_IS_UP_NUM_VAR) ? "on" : "off");
    http_send (FS("\"}"));
    http_flush ();

    return 0;
}

static int
http_api_dfplayer_volume_set ()
{
    char * value = http_get_param ("value");
    int    volume = atoi (value ? value : "0");

    if (volume < 0)
    {
        volume = 0;
    }
    else if (volume > DFPLAYER_MAX_VOLUME)
    {
        volume = DFPLAYER_MAX_VOLUME;
    }

    set_numvar (DFPLAYER_VOLUME_NUM_VAR, volume);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"dfplayer_volume\":"));
    char buf[8];
    sprintf (buf, "%d", volume);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_dfplayer_mode_set ()
{
    char * value = http_get_param ("value");
    int    mode = atoi (value ? value : "0");

    if (mode < DFPLAYER_MODE_NONE)
    {
        mode = DFPLAYER_MODE_NONE;
    }
    else if (mode > DFPLAYER_MODE_SPEAK)
    {
        mode = DFPLAYER_MODE_SPEAK;
    }

    set_numvar (DFPLAYER_MODE_NUM_VAR, mode);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_bell_flags_set ()
{
    uint_fast8_t flags = DFPLAYER_MODE_BELL_FLAG_NONE;

    if (http_get_on_off_value ("m15", 0))
    {
        flags |= DFPLAYER_MODE_BELL_FLAG_15;
    }
    if (http_get_on_off_value ("m30", 0))
    {
        flags |= DFPLAYER_MODE_BELL_FLAG_30;
    }
    if (http_get_on_off_value ("m45", 0))
    {
        flags |= DFPLAYER_MODE_BELL_FLAG_45;
    }

    set_numvar (DFPLAYER_BELL_FLAGS_NUM_VAR, flags);
    http_json_ok ();

