granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_dfplayer_speak_cycle_set ()
{
    char * value = http_get_param ("value");
    int    speak_cycle = atoi (value ? value : "0");

    if (speak_cycle < 0)
    {
        speak_cycle = 0;
    }
    else if (speak_cycle > 255)
    {
        speak_cycle = 255;
    }

    set_numvar (DFPLAYER_SPEAK_CYCLE_NUM_VAR, speak_cycle);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_silence_start_set ()
{
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (hour >= 0 && hour < 24 && minute >= 0 && minute < 60)
    {
        set_numvar (DFPLAYER_SILENCE_START_NUM_VAR, hour * 60 + minute);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_silence_stop_set ()
{
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (hour >= 0 && hour < 24 && minute >= 0 && minute < 60)
    {
        set_numvar (DFPLAYER_SILENCE_STOP_NUM_VAR, hour * 60 + minute);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_play ()
{
    int folder = atoi (http_get_param ("folder"));
    int track = atoi (http_get_param ("track"));

    if (folder < 0)
    {
        folder = 0;
    }
    else if (folder > 255)
    {
        folder = 255;
    }

    if (track < 0)
    {
        track = 0;
    }
    else if (track > 255)
    {
        track = 255;
    }

    set_numvar (DFPLAYER_PLAY_FOLDER_TRACK_NUM_VAR, folder << 8 | track);
    http_json_ok ();

    return 0;
}

static int
http_api_dfplayer_alarm_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_ALARM_TIME_VARIABLES)
    {
        ALARM_TIME *    at;
        uint_fast8_t    from_day;
        uint_fast8_t    to_day;
        uint_fast16_t   minutes;
        uint_fast8_t    flags;

        at = get_alarm_time_var ((ALARM_TIME_VARIABLE) idx);
        flags = at ? at->flags : 0;

        if (http_get_on_off_value ("active", 0))
        {
            flags |= ALARM_TIME_FLAG_ACTIVE;
        }
        else
        {
            flags &= ~ALARM_TIME_FLAG_ACTIVE;
        }

        from_day = atoi (http_get_param ("from"));
        to_day = atoi (http_get_param ("to"));

        flags &= ~(ALARM_TIME_FROM_DAY_MASK | ALARM_TIME_TO_DAY_MASK);
        flags |= ALARM_TIME_FROM_DAY_MASK & (from_day << 3);
        flags |= ALARM_TIME_TO_DAY_MASK & to_day;

        minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));
        set_alarm_time_var ((ALARM_TIME_VARIABLE) idx, minutes, flags);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);

    if (idx >= 0 && idx < MAX_OVERLAYS)
    {
        if (idx == n_overlays && n_overlays < MAX_OVERLAYS)
        {
            n_overlays++;
            set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays);
        }

        if (idx < n_overlays)
        {
            uint_fast8_t val;
            uint_fast8_t valmm;
            uint_fast8_t valdd;
            char * text;

            if (http_get_on_off_value ("active", 0))
            {
                overlays[idx].flags |= OVERLAY_FLAG_ACTIVE;
            }
            else
            {
                overlays[idx].flags &= ~OVERLAY_FLAG_ACTIVE;
            }

            overlays[idx].type = atoi (http_get_param ("type"));
            val = atoi (http_get_param ("interval"));

            if (val == 0)
            {
                val = 5;
            }

            overlays[idx].interval = val;

            val = atoi (http_get_param ("duration"));

            if (val < 5)
            {
                val = 5;
            }
            else if (val > 9)
            {
                val = 9;
            }

            overlays[idx].duration = val;
            overlays[idx].date_code = atoi (http_get_param ("date_code"));

            valmm = atoi (http_get_param ("month"));
            valdd = atoi (http_get_param ("day"));

            if (valmm < 1 || valmm > 12 || valdd < 1 || valdd > 31)
            {
                overlays[idx].date_start = 0;
            }
            else
            {
                overlays[idx].date_start  = (valmm << 8) | valdd;
            }

            val = atoi (http_get_param ("days"));

            if (val < 1)
            {
                val = 1;
            }

            overlays[idx].days = val;

            text = http_get_param ("value");

            if (text)
            {
                strncpy (overlays[idx].text, text, OVERLAY_MAX_TEXT_LEN);
                overlays[idx].text[OVERLAY_MAX_TEXT_LEN] = '\0';
            }

            set_overlay_var (idx);
        }
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_display ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR))
    {
        set_numvar (DISPLAY_OVERLAY_NUM_VAR, idx);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_delete ()
{
    int idx = atoi (http_get_param ("idx"));
    int n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);
    int i;

    if (idx >= 0 && idx < n_overlays)
    {
        for (i = idx; i < n_overlays - 1; i++)
        {
            overlays[i] = overlays[i + 1];
            set_overlay_var (i);
        }

        if (n_overlays > 0)
        {
            memset (&overlays[n_overlays - 1], 0, sizeof (OVERLAY));
            set_overlay_var (n_overlays - 1);
            set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays - 1);
        }
    }

    http_json_ok ();

    return 0;
}

static int
http_api_timer_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_NIGHT_TIME_VARIABLES)
    {
        uint_fast8_t flags = 0;
        uint_fast8_t from_day = atoi (http_get_param ("from"));
        uint_fast8_t to_day = atoi (http_get_param ("to"));
        uint_fast16_t minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));

