granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (fname && *fname)
    {
        LittleFS.begin ();
        LittleFS.remove (fname);
        LittleFS.end ();
    }

    http_json_ok ();

    return 0;
}

static int
http_api_update_status ()
{
    STR_VAR * sv;
    char * update_host;
    char * update_path;
    uint32_t flashsize;
    char new_esp_version[16];
    char new_app_version[16];
    char new_wc_version[16];
    char stm32_default_filename[MAX_UPDATE_FILENAME_LEN];
    const char * filter = (const char *) NULL;
    String release_notes;
    uint_fast8_t assets_available = 0;
    const char * fname_icon = (const char *) 0;
    const char * fname_weather = (const char *) 0;
    int len;
    int first = 1;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    flashsize = ESP.getFlashChipRealSize ();
    http_fetch_remote_line (update_host, update_path, ESP_WORDCLOCK_TXT, new_esp_version, sizeof (new_esp_version));
    http_fetch_remote_line (update_host, update_path, APP_VERSION_TXT, new_app_version, sizeof (new_app_version));
    http_fetch_remote_line (update_host, update_path, WC_TXT, new_wc_version, sizeof (new_wc_version));
    release_notes = http_fetch_remote_text (update_host, update_path, RELEASENOTE_HTML, 3072);
    http_build_stm32_default_filename (stm32_default_filename, sizeof (stm32_default_filename), &filter);

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon = "wc24h-icon.txt";
                fname_weather = "wc24h-weather.txt";
                break;
            case HW_WC_12H:
                fname_icon = "wc12h-icon.txt";
                fname_weather = "wc12h-weather.txt";
                break;
            case HW_UCLOCK:
                fname_icon = "uc-icon.txt";
                fname_weather = "uc-weather.txt";
                break;
        }
    }

    if (fname_icon && fname_weather)
    {
        int len_icon = httpclient (update_host, update_path, fname_icon);

        if (len_icon > 0)
        {
            httpclient_stop ();

            int len_weather = httpclient (update_host, update_path, fname_weather);

            if (len_weather > 0)
            {
                assets_available = 1;
                httpclient_stop ();
            }
        }
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"flash_size\":"));

    char buf[16];
    sprintf (buf, "%d", flashsize);
    http_send (buf);

    http_json_send_bool_field (FS("can_update"), flashsize >= 4194304UL);
    http_json_send_bool_field (FS("local_update_supported"), flashsize >= 1048576UL);
    http_json_send_string_field (FS("local_update_message"), http_get_local_update_message (flashsize));
    http_json_send_bool_field (FS("assets_available"), assets_available);
    http_json_send_bool_field (FS("app_bundle_available"), 0);
    http_json_send_bool_field (FS("device_ready_api_supported"), 1);
    http_json_send_bool_field (FS("reconnect_probe_api_supported"), 1);
    http_json_send_bool_field (FS("settings_api_supported"), 1);
    http_json_send_bool_field (FS("display_power_api_supported"), 1);
    http_json_send_bool_field (FS("ambilight_power_api_supported"), 1);
    http_json_send_bool_field (FS("power_status_api_supported"), 1);
    http_json_send_bool_field (FS("update_download_assets_api_supported"), 1);
    http_json_send_bool_field (FS("update_download_app_bundle_api_supported"), 0);
    http_json_send_bool_field (FS("update_download_table_api_supported"), 1);
    http_json_send_bool_field (FS("app_file_upload_api_supported"), 1);
    http_json_send_bool_field (FS("app_bundle_upload_api_supported"), 0);
    http_json_send_bool_field (FS("fs_target_upload_api_supported"), 1);
    http_json_send_bool_field (FS("local_stm32_upload_api_supported"), 1);
    http_json_send_bool_field (FS("local_esp_update_api_supported"), 1);
    http_json_send_remote_update_support_fields ();

    http_json_send_string_field (FS("device_ready_url"), "/api/device_ready");
    http_json_send_string_field (FS("reconnect_probe_url"), "/api/reconnect_probe");
    http_json_send_remote_update_url_fields ();
    http_json_send_string_field (FS("update_status_url"), "/api/update_status");
    http_json_send_string_field (FS("settings_url"), "/api/settings_xml");
    http_json_send_string_field (FS("display_power_url"), "/api/display_power");
    http_json_send_string_field (FS("display_power_set_url"), "/api/display_power_set");
    http_json_send_string_field (FS("display_test_url"), "/api/test_display");
    http_json_send_string_field (FS("display_brightness_set_url"), "/api/display_brightness_set");
    http_json_send_string_field (FS("display_it_is_set_url"), "/api/display_it_is_set");
    http_json_send_string_field (FS("display_mode_set_url"), "/api/display_mode_set");
    http_json_send_string_field (FS("display_use_rgbw_set_url"), "/api/display_use_rgbw_set");
    http_json_send_string_field (FS("ticker_set_url"), "/api/ticker_set");
    http_json_send_string_field (FS("date_ticker_format_set_url"), "/api/date_ticker_format_set");
    http_json_send_string_field (FS("ticker_deceleration_set_url"), "/api/ticker_deceleration_set");
    http_json_send_string_field (FS("ambilight_power_url"), "/api/ambilight_power");
    http_json_send_string_field (FS("ambilight_power_set_url"), "/api/ambilight_power_set");
    http_json_send_string_field (FS("ambilight_online_set_url"), "/api/ambilight_online_set");
    http_json_send_string_field (FS("power_status_url"), "/api/power_status");
    http_json_send_string_field (FS("maintenance_reset_stm32_url"), "/api/maintenance_reset_stm32");
    http_json_send_string_field (FS("maintenance_reset_eeprom_url"), "/api/maintenance_reset_eeprom");
    http_json_send_string_field (FS("maintenance_format_fs_url"), "/api/maintenance_format_fs");
    http_json_send_string_field (FS("auto_brightness_set_url"), "/api/auto_brightness_set");
    http_json_send_string_field (FS("network_timeserver_set_url"), "/api/network_timeserver_set");
    http_json_send_string_field (FS("network_client_set_url"), "/api/network_client_set");
    http_json_send_string_field (FS("network_ap_set_url"), "/api/network_ap_set");
    http_json_send_string_field (FS("network_timezone_set_url"), "/api/network_timezone_set");
    http_json_send_string_field (FS("network_summertime_set_url"), "/api/network_summertime_set");
    http_json_send_string_field (FS("update_host_set_url"), "/api/update_host_set");
    http_json_send_string_field (FS("update_path_set_url"), "/api/update_path_set");
    http_json_send_string_field (FS("datetime_set_url"), "/api/datetime_set");
    http_json_send_string_field (FS("weather_appid_set_url"), "/api/weather_appid_set");
    http_json_send_string_field (FS("weather_city_set_url"), "/api/weather_city_set");
    http_json_send_string_field (FS("weather_coordinates_set_url"), "/api/weather_coordinates_set");
    http_json_send_string_field (FS("weather_get_now_url"), "/api/weather_get_now");
    http_json_send_string_field (FS("weather_get_forecast_url"), "/api/weather_get_forecast");
    http_json_send_string_field (FS("learn_ir_url"), "/api/learn_ir");
    http_json_send_string_field (FS("network_get_time_url"), "/api/network_get_time");
    http_json_send_string_field (FS("network_wps_url"), "/api/network_wps");
    http_json_send_string_field (FS("temperature_display_url"), "/api/temperature_display");
    http_json_send_string_field (FS("temperature_rtc_correction_set_url"), "/api/temperature_rtc_correction_set");
    http_json_send_string_field (FS("temperature_ds18xx_correction_set_url"), "/api/temperature_ds18xx_correction_set");
    http_json_send_string_field (FS("ldr_min_set_url"), "/api/ldr_min_set");
    http_json_send_string_field (FS("ldr_max_set_url"), "/api/ldr_max_set");
    http_json_send_string_field (FS("ldr_min_value_set_url"), "/api/ldr_min_value_set");
    http_json_send_string_field (FS("ldr_max_value_set_url"), "/api/ldr_max_value_set");
    http_json_send_string_field (FS("animation_mode_set_url"), "/api/animation_mode_set");
    http_json_send_string_field (FS("color_animation_mode_set_url"), "/api/color_animation_mode_set");
    http_json_send_string_field (FS("sync_ambilight_set_url"), "/api/sync_ambilight_set");
    http_json_send_string_field (FS("sync_markers_set_url"), "/api/sync_markers_set");
    http_json_send_string_field (FS("fade_clock_seconds_set_url"), "/api/fade_clock_seconds_set");
    http_json_send_string_field (FS("ambilight_markers_set_url"), "/api/ambilight_markers_set");
    http_json_send_string_field (FS("ambilight_brightness_set_url"), "/api/ambilight_brightness_set");
    http_json_send_string_field (FS("ambilight_mode_set_url"), "/api/ambilight_mode_set");
    http_json_send_string_field (FS("ambilight_leds_set_url"), "/api/ambilight_leds_set");
    http_json_send_string_field (FS("ambilight_offset_set_url"), "/api/ambilight_offset_set");
    http_json_send_string_field (FS("display_color_set_url"), "/api/display_color_set");
    http_json_send_string_field (FS("ambilight_color_set_url"), "/api/ambilight_color_set");
    http_json_send_string_field (FS("marker_color_set_url"), "/api/marker_color_set");
    http_json_send_string_field (FS("dfplayer_volume_set_url"), "/api/dfplayer_volume_set");
    http_json_send_string_field (FS("dfplayer_mode_set_url"), "/api/dfplayer_mode_set");
    http_json_send_string_field (FS("dfplayer_bell_flags_set_url"), "/api/dfplayer_bell_flags_set");
    http_json_send_string_field (FS("dfplayer_speak_cycle_set_url"), "/api/dfplayer_speak_cycle_set");
    http_json_send_string_field (FS("dfplayer_silence_start_set_url"), "/api/dfplayer_silence_start_set");
    http_json_send_string_field (FS("dfplayer_silence_stop_set_url"), "/api/dfplayer_silence_stop_set");
    http_json_send_string_field (FS("dfplayer_play_url"), "/api/dfplayer_play");
    http_json_send_string_field (FS("dfplayer_alarm_set_url"), "/api/dfplayer_alarm_set");
    http_json_send_string_field (FS("overlay_set_url"), "/api/overlay_set");
    http_json_send_string_field (FS("overlay_display_url"), "/api/overlay_display");
    http_json_send_string_field (FS("overlay_delete_url"), "/api/overlay_delete");
    http_json_send_string_field (FS("timer_set_url"), "/api/timer_set");
    http_json_send_string_field (FS("ambilight_timer_set_url"), "/api/ambilight_timer_set");
    http_json_send_string_field (FS("update_download_assets_url"), "/api/update_download_assets");
    http_json_send_string_field (FS("update_download_app_bundle_url"), "");
    http_json_send_string_field (FS("update_download_table_base_url"), "/api/update_download_table?filename=");
    http_json_send_string_field (FS("app_file_upload_url"), "/api/app_file_upload");
    http_json_send_string_field (FS("app_bundle_upload_url"), "");
    http_json_send_string_field (FS("fs_info_url"), "/api/fs_info");
    http_json_send_string_field (FS("fs_list_url"), "/api/fs_list");
    http_json_send_string_field (FS("eeprom_settings_url"), "/api/eeprom_settings");
    http_json_send_string_field (FS("update_table_files_url"), "/api/update_table_files");
    http_json_send_string_field (FS("fs_upload_icon_url"), "/api/fs_upload_icon");
    http_json_send_string_field (FS("fs_upload_weather_url"), "/api/fs_upload_weather");
    http_json_send_string_field (FS("fs_upload_tables_url"), "/api/fs_upload_tables");
    http_json_send_string_field (FS("fs_upload_display_url"), "/api/fs_upload_display");
    http_json_send_string_field (FS("fs_upload_txt_accept"), ".txt,text/plain");
    http_json_send_string_field (FS("app_bundle_upload_accept"), "");
    http_json_send_string_field (FS("local_esp_update_accept"), ".bin,application/octet-stream");
    http_json_send_string_field (FS("local_stm32_upload_accept"), ".hex");
    http_json_send_string_field (FS("fs_show_base_url"), "/api/fs_show?filename=");
    http_json_send_string_field (FS("fs_remove_base_url"), "/api/fs_remove?filename=");
    http_json_send_string_field (FS("local_stm32_upload_url"), "/api/local_stm32_upload");
    http_json_send_string_field (FS("local_stm32_flash_url"), "/api/local_stm32_flash");
    http_json_send_string_field (FS("local_esp_update_url"), "/api/local_esp_update");
    http_json_send_string_field (FS("local_esp_restart_url"), "/api/local_esp_restart");
    http_json_send_string_field (FS("stm32_log_url"), "/api/stm32_log");
    http_json_send_string_field (FS("stm32_log_clear_url"), "/api/stm32_log_clear");
    http_json_send_string_field (FS("update_progress_url"), "/api/update_progress");
    http_json_send_string_field (FS("network_scan_url"), "/api/network_scan");
    http_json_send_string_field (FS("overlay_icons_url"), "/api/overlay_icons");
    http_json_send_string_field (FS("live_display_color_url"), "/api/live_display_color");
    http_json_send_string_field (FS("eeprom_settings_set_url"), "/api/eeprom_settings_set");
    http_json_send_string_field (FS("display_dim_level_set_url"), "/api/display_dim_level_set");
    http_json_send_string_field (FS("ambilight_dim_level_set_url"), "/api/ambilight_dim_level_set");
    http_json_send_string_field (FS("animation_profile_set_url"), "/api/animation_profile_set");
    http_json_send_string_field (FS("animation_profile_default_url"), "/api/animation_profile_default");
    http_json_send_string_field (FS("color_animation_profile_set_url"), "/api/color_animation_profile_set");
    http_json_send_string_field (FS("color_animation_profile_default_url"), "/api/color_animation_profile_default");
    http_json_send_string_field (FS("ambilight_mode_profile_set_url"), "/api/ambilight_mode_profile_set");
    http_json_send_string_field (FS("ambilight_mode_profile_default_url"), "/api/ambilight_mode_profile_default");
    http_json_send_string_field (FS("tft_flags_set_url"), "/api/tft_flags_set");
    http_json_send_string_field (FS("fs_upload_icon_target"), http_get_fs_upload_filename (POST_ICON_FILE));
    http_json_send_string_field (FS("fs_upload_weather_target"), http_get_fs_upload_filename (POST_ICON_WEATHER_FILE));
    http_json_send_string_field (FS("fs_upload_tables_target"), http_get_fs_upload_filename (POST_TABLES_FILE));
    http_json_send_string_field (FS("fs_upload_display_target"), http_get_fs_upload_filename (POST_DISPLAY_FILE));
    http_json_send_string_field (FS("fs_upload_tables_prefix"), http_get_tables_family_prefix ());
    http_json_send_string_field (FS("asset_prefix"), http_get_asset_prefix ());
    http_json_send_bool_field (FS("layout_is_12h"), (hardware_configuration & HW_WC_MASK) == HW_WC_12H);
    http_json_send_string_field (FS("hardware_label"), http_get_hardware_label ());
    http_json_send_string_field (FS("processor_label"), http_get_processor_label ());
    http_json_send_string_field (FS("board_label"), http_get_board_label ());
    http_json_send_string_field (FS("frequency_label"), http_get_frequency_label ());
    http_json_send_string_field (FS("oscillator_label"), http_get_oscillator_label ());
    http_json_send_string_field (FS("display_label"), http_get_display_label ());
    http_json_send_string_field (FS("display_led_mode"), http_get_display_led_mode ());
    http_json_send_bool_field (FS("display_has_tft"), (hardware_configuration & HW_LED_MASK) == HW_LED_TFTLED_RGB_LED);
    http_json_send_bool_field (FS("display_has_white_channel"), (hardware_configuration & HW_LED_MASK) == HW_LED_SK6812_RGBW_LED);
    http_json_send_string_field (FS("default_layout_preview_file"), http_get_default_layout_preview_filename ());
    http_json_send_uint_field (FS("default_layout_columns"), (unsigned long) http_get_default_layout_columns ());
    http_json_send_string_field (FS("local_stm32_expected_filename"), stm32_default_filename);
    http_json_send_string_field (FS("esp_version"), ESP_VERSION);
    http_json_send_string_field (FS("esp_available"), new_esp_version);
    http_json_send_string_field (FS("app_available"), new_app_version);
    http_json_send_string_field (FS("wc_version"), get_strvar (VERSION_STR_VAR)->str);
    http_json_send_string_field (FS("wc_available"), new_wc_version);
    http_json_send_string_field (FS("release_notes"), release_notes);
    http_json_send_string_field (FS("stm32_default"), stm32_default_filename);
    http_send (FS(",\"stm32_files\":["));

    len = httpclient (update_host, update_path, WC_LIST_TXT);

    if (len > 0)
    {
        char fname[MAX_UPDATE_FILENAME_LEN];
        int ch;
        int l = 0;

        while (len > 0)
        {
            ch = httpclient_read (&len);

