granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
            {
                fname[l++] = ch;
            }
            else if (ch == '\n')
            {
                int show_option = 1;

                fname[l] = '\0';
                l = 0;

                if (filter)
                {
                    int fname_len = strlen (fname);

                    if (fname_len < 6 || strncmp (fname + 6, filter, strlen (filter)) != 0)
                    {
                        show_option = 0;
                    }
                }

                if (show_option)
                {
                    if (! first)
                    {
                        http_send (FS(","));
                    }

                    http_send (FS("\""));
                    http_send (sanitize_json_string (fname).c_str ());
                    http_send (FS("\""));
                    first = 0;
                }
            }
        }

        httpclient_stop ();
    }

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static int
http_api_update_progress ()
{
    char buf[16];

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"active\":"));
    http_send (update_progress.active ? "true" : "false");
    http_send (FS(",\"type\":\""));
    http_send (sanitize_json_string (update_progress.type).c_str ());
    http_send (FS("\",\"state\":\""));
    http_send (sanitize_json_string (update_progress.state).c_str ());
    http_send (FS("\",\"message\":\""));
    http_send (sanitize_json_string (update_progress.message).c_str ());
    http_send (FS("\",\"progress_current\":"));
    sprintf (buf, "%u", (unsigned) update_progress.progress_current);
    http_send (buf);
    http_send (FS(",\"progress_total\":"));
    sprintf (buf, "%u", (unsigned) update_progress.progress_total);
    http_send (buf);
    http_send (FS(",\"error_code\":"));
    sprintf (buf, "%u", (unsigned) update_progress.error_code);
    http_send (buf);
    http_send (FS(",\"started_at\":"));
    sprintf (buf, "%u", (unsigned) update_progress.started_at);
    http_send (buf);
    http_send (FS(",\"updated_at\":"));
    sprintf (buf, "%u", (unsigned) update_progress.updated_at);
    http_send (buf);
    http_send (FS(",\"finished_at\":"));
    sprintf (buf, "%u", (unsigned) update_progress.finished_at);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();
    return 0;
}

static int
http_api_device_ready ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ready\":true}"));
    http_flush ();
    return 0;
}

static void
http_json_send_remote_update_support_fields ()
{
    http_json_send_bool_field (FS("remote_esp_update_api_supported"), 1);
    http_json_send_bool_field (FS("remote_stm32_flash_api_supported"), 1);
}

static void
http_json_send_remote_update_url_fields ()
{
    http_json_send_string_field (FS("remote_esp_update_url"), "/api/remote_esp_update");
    http_json_send_string_field (FS("remote_stm32_flash_url"), "/api/remote_stm32_flash");
}

static int
http_api_reconnect_probe ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ready\":true,\"display_power\":\""));
    http_send(get_numvar (DISPLAY_POWER_NUM_VAR) ? "on" : "off");
    http_send (FS("\",\"ambilight_power\":\""));
    http_send(get_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR) ? "on" : "off");
    http_send (FS("\"}"));
    http_flush ();
    return 0;
}

static int
http_api_remote_esp_update ()
{
    STR_VAR *           sv;
    char *              update_host;
    char *              update_path;
    char                path[MAX_UPDATE_HOST_LEN + MAX_UPDATE_PATH_LEN + MAX_UPDATE_FILENAME_LEN + 3];
    uint32_t            flashsize = ESP.getFlashChipRealSize ();

    if (flashsize < 4194304)
    {
        http_send (FS("HTTP/1.0 400 Bad Request\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
        http_send (FS("{\"ok\":false,\"error\":1,\"message\":\"ESP-Flashgröße für OTA zu klein\"}"));
        http_flush ();
        return 0;
    }

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    sprintf (path, "/%s/%s", update_path, ESP_WORDCLOCK_BIN);
    update_progress_begin ("esp", "starting", "ESP-Firmware-Update wird gestartet.");

    http_header ("Update", "40", "/app/");
    begin_box ("Update");
    http_send_FS ("<P><B>Updating ESP firmware '");
    http_send (path);
    http_send_FS ("', reconnecting in 40 seconds ...</B></BR>\r\n");
    end_box ();
    http_trailer ();
    http_flush ();

    while (http_client.available())                               // firefox claims about connection reset, if we do not read all characters
    {
        http_client.read();
    }

    http_client.stop();
    delay (200);
    update_progress_state ("reconnect_wait", "ESP-Firmware wird geladen. Gerät startet danach neu.");

    t_httpUpdate_return ret = ESPhttpUpdate.update (http_client, update_host, 80, path);

    switch(ret)
    {
        case HTTP_UPDATE_FAILED:
            Serial.println("HTTP update: failed");
            update_progress_fail (ESPhttpUpdate.getLastError (), ESPhttpUpdate.getLastErrorString ().c_str ());
            break;

        case HTTP_UPDATE_NO_UPDATES:
            Serial.println("HTTP update: no updates");
            update_progress_complete ("Keine neue ESP-Firmware verfügbar.");
            break;

        case HTTP_UPDATE_OK:
            Serial.println("HTTP update: ok");                    // will never be called, because we are rebooting
            break;
    }

