granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return rtc;
}

void
http_post(const String& sPath)
{
    if (sPath == "/flash_stm32_local")
    {
        flash_stm32_local (true);
    }
    else if (sPath == "/fs-icon")
    {
        http_fs (POST_ICON_FILE);
    }
    else if (sPath == "/fs-icon-weather")
    {
        http_fs (POST_ICON_WEATHER_FILE);
    }
    else if (sPath == "/fs-tables")
    {
        http_fs (POST_TABLES_FILE);
    }
    else if (sPath == "/fs-display")
    {
        http_fs (POST_DISPLAY_FILE);
    }
    else if (sPath == "/api/fs_upload_icon")
    {
        http_api_fs_upload (POST_ICON_FILE);
    }
    else if (sPath == "/api/fs_upload_weather")
    {
        http_api_fs_upload (POST_ICON_WEATHER_FILE);
    }
    else if (sPath == "/api/fs_upload_tables")
    {
        http_api_fs_upload (POST_TABLES_FILE);
    }
    else if (sPath == "/api/fs_upload_display")
    {
        http_api_fs_upload (POST_DISPLAY_FILE);
    }
    else if (sPath == "/api/app_file_upload")
    {
        http_api_app_file_upload ();
    }
    else if (sPath == "/api/local_stm32_upload")
    {
        http_api_local_stm32_upload ();
    }
    else if (sPath == "/api/local_esp_update")
    {
        http_api_local_esp_update ();
    }
}

/*----------------------------------------------------------------------------------------------------------------------------------------
 * http server
 *----------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_server_loop (void)
{
    String  sPath       = "";
    String  sParam      = "";
    String  sCmd        = "";
    String  sGetstart   = "GET ";
    String  sPoststart  = "POST ";
    String  sResponse   = "";
    int     start_position;
    int     end_position_space;
    int     end_position_question;
    String  sRemoteIp;
    String  sHeaderLine;

    http_client = http_server.accept();                                     // check if a client has connected

    if (!http_client)                                                       // wait until the client sends some data
    {
        return;
    }

    sRemoteIp = http_client.remoteIP().toString();
    http_clear_request_user_agent ();

    Serial.print ("- new client");
    if (sRemoteIp.length ())
    {
        Serial.print (" from ");
        Serial.print (sRemoteIp);
    }
    Serial.println ();
    Serial.flush ();

    unsigned long ultimeout = millis() + 250;

    while (! http_client.available() && (millis() < ultimeout) )
    {
        delay(1);
    }

    if (millis() > ultimeout)
    {
        Serial.println ("- client connection time-out!");
        Serial.flush ();
        return;
    }
    http_client.setNoDelay(1);

    String sRequest = "";

    if (! http_read_request_line (sRequest, 300))                          // read the first line of the request with a short timeout
    {
        Serial.println ("- empty http request");
        Serial.flush ();
        while (http_client.available())
        {
            http_client.read();
        }
        http_client.stop();
        return;
    }

    if (sRequest == "")                                                     // stop client, if request is empty
    {
        Serial.println ("- empty http request");
        Serial.flush ();
        while (http_client.available())                                     // firefox claims about connection reset, if we do not read all characters
        {
            http_client.read();
        }
        http_client.stop();
        return;
    }

    // POST
    start_position = sRequest.indexOf(sPoststart);

    if (start_position == 0)
    {
        Serial.print ("- request");
        if (sRemoteIp.length ())
        {
            Serial.print (" ");
            Serial.print (sRemoteIp);
        }
        Serial.print (": ");
        Serial.println (sRequest);
        Serial.flush ();

        start_position += sPoststart.length ();
        end_position_space = sRequest.indexOf (" ", start_position);
        end_position_question = sRequest.indexOf ("?", start_position);

        if (end_position_space > 0)
        {
            if (end_position_question > 0)
            {
                char param[256];

                sPath  = sRequest.substring(start_position, end_position_question);
                sParam = sRequest.substring(end_position_question + 1, end_position_space);

                strncpy (param, sParam.c_str (), 255);
                param[255] = '\0';
                http_set_params (param);
            }
            else
            {
                sPath = sRequest.substring(start_position, end_position_space);
                http_set_params ((char *) NULL);
            }
        }
        http_post (sPath);
    }
    else // GET
    {
        while (read_line (sHeaderLine))
        {
            if (sHeaderLine == "")
            {
                if (http_client.available () && http_client.peek () == '\n')
                {
                    http_client.read ();
                }
                break;
            }

            if (sHeaderLine.startsWith ("User-Agent:"))
            {
                http_capture_request_user_agent (sHeaderLine);
            }
        }

        Serial.print ("- request");
        if (sRemoteIp.length ())
        {
            Serial.print (" ");
            Serial.print (sRemoteIp);
        }
        if (http_get_request_browser_label ())
        {
            Serial.print (" [");
            Serial.print (http_get_request_browser_label ());
            Serial.print ("]");
        }
        Serial.print (": ");
        Serial.println (sRequest);
        Serial.flush ();

        start_position = sRequest.indexOf(sGetstart);

        if (start_position >= 0)
        {
            start_position += sGetstart.length ();
            end_position_space = sRequest.indexOf (" ", start_position);
            end_position_question = sRequest.indexOf ("?", start_position);

            if (end_position_space > 0)                                         // parameters?
            {
                if (end_position_question > 0)
                {                                                               // yes
                    sPath  = sRequest.substring(start_position, end_position_question);
                    sParam = sRequest.substring(end_position_question + 1, end_position_space);
                }
                else
                {                                                               // no
                    sPath  = sRequest.substring(start_position, end_position_space);
                }
            }
        }

        http (sPath.c_str(), sParam.c_str());
    }

    http_client.flush();

    while (http_client.available())                                         // firefox claims about connection reset, if we do not read all characters
    {
        http_client.read();
    }

    http_client.stop();                                                     // stop client
}

/*----------------------------------------------------------------------------------------------------------------------------------------
 * http server begin
 *----------------------------------------------------------------------------------------------------------------------------------------
 */
void
http_server_begin (void)
{
    http_server.begin();
}
